<p><span style="font-weight: 400;">Copyright &copy; 2014-2017, The Open Group</span></p>
<p><span style="font-weight: 400;">L'Open Group vous autorise par la pr&eacute;sente &agrave; utiliser ce document &agrave; quelque fin que ce soit, &agrave; condition que toute copie de ce document, ou toute partie de celui-ci, que vous cr&eacute;ez conserve tous les droits d'auteur et autres avis de propri&eacute;t&eacute; contenus dans ce document.</span></p>
<p><span style="font-weight: 400;">Ce document peut contenir d'autres avis de propri&eacute;t&eacute; et des informations sur les droits d'auteur.</span></p>
<p><span style="font-weight: 400;">Rien de ce qui est contenu dans ce document ne doit &ecirc;tre interpr&eacute;t&eacute; comme conf&eacute;rant par implication, pr&eacute;clusion ou autrement une licence ou un droit en vertu de tout brevet ou marque de commerce de The Open Group ou de tout tiers. Sauf disposition expresse ci-dessus, rien de ce qui est contenu dans le pr&eacute;sent document ne doit &ecirc;tre interpr&eacute;t&eacute; comme conf&eacute;rant une licence ou un droit en vertu de tout droit d'auteur de The Open Group.</span></p>
<p><span style="font-weight: 400;">Notez que tout produit, processus ou technologie dans ce document peut faire l'objet d'autres droits de propri&eacute;t&eacute; intellectuelle r&eacute;serv&eacute;s par The Open Group et ne peut pas faire l'objet d'une licence en vertu des pr&eacute;sentes.</span></p>
<p><span style="font-weight: 400;">Ce document est fourni "EN L'&Eacute;TAT" SANS GARANTIE D'AUCUNE SORTE, EXPRESSE OU IMPLICITE, Y COMPRIS, MAIS SANS S'Y LIMITER, LES GARANTIES IMPLICITES DE QUALIT&Eacute; MARCHANDE, D'ADAPTATION &Agrave; UN USAGE PARTICULIER OU DE NON-CONTREFA&Ccedil;ON. Certaines juridictions n'autorisant pas l'exclusion des garanties implicites, l'exclusion ci-dessus peut ne pas s'appliquer &agrave; vous.</span></p>
<p><span style="font-weight: 400;">Toute publication de The Open Group peut comporter des inexactitudes techniques ou des erreurs typographiques. Des modifications peuvent &ecirc;tre apport&eacute;es p&eacute;riodiquement &agrave; ces publications; ces changements seront incorpor&eacute;s dans les nouvelles &eacute;ditions de ces publications. L'Open Group peut apporter des am&eacute;liorations et / ou des modifications aux produits et / ou programmes d&eacute;crits dans ces publications &agrave; tout moment et sans pr&eacute;avis.</span></p>
<p><span style="font-weight: 400;">Si un spectateur de ce document r&eacute;pond avec des informations, y compris des donn&eacute;es de retour, telles que des questions, des commentaires, des suggestions ou autres concernant le contenu de ce document, ces informations seront consid&eacute;r&eacute;es comme non confidentielles et The Open Group n'aura aucune obligation de de quelque nature que ce soit &agrave; l'&eacute;gard de ces informations et sera libre de reproduire, utiliser, divulguer et distribuer les informations &agrave; des tiers sans limitation. En outre, l'Open Group est libre d'utiliser les id&eacute;es, concepts, savoir-faire ou techniques contenus dans ces informations &agrave; quelque fin que ce soit, y compris, mais sans s'y limiter, le d&eacute;veloppement, la fabrication et la commercialisation de produits incorporant ces informations.</span></p>
<p><span style="font-weight: 400;">Si vous n'avez pas obtenu cette copie via The Open Group, il ne s'agit peut-&ecirc;tre pas de la derni&egrave;re version. Pour votre commodit&eacute;, la derni&egrave;re version de cette publication peut &ecirc;tre t&eacute;l&eacute;charg&eacute;e &agrave; l'adresse www.opengroup.org/bookstore.</span></p>
<p><span style="font-weight: 400;">ArchiMate&reg;, DirecNet&reg;, Making Standards Work&reg;, OpenPegasus&reg;, The Open Group&reg;, TOGAF&reg;, UNIX&reg;, UNIXWARE&reg;, X / Open&reg; et le logo Open Brand X&reg; sont des marques d&eacute;pos&eacute;es et Boundaryless Information Flow &trade;, Build avec int&eacute;grit&eacute; Achetez avec confiance &trade;, fiabilit&eacute; gr&acirc;ce &agrave; Assuredness &trade;, EMMM &trade;, FACE &trade;, le logo FACE &trade;, IT4IT &trade;, le logo IT4IT &trade;, O-DEF &trade;, O-PAS &trade;, Open FAIR &trade;, Open Platform 3.0 &trade;, Open Process Automation &trade;, Open Trusted Technology Provider &trade;, Platform 3.0 &trade;, SOSA &trade;, le logo Open O &trade; et le logo Open Group Certification (Open O et check &trade;) sont des marques commerciales de The Open Group.</span></p>
<p><span style="font-weight: 400;">Object Management Group&reg;, OMG&reg; et UML&reg; sont des marques d&eacute;pos&eacute;es et BPMN &trade; est une marque d'Object Management Group, Inc. aux &Eacute;tats-Unis et / ou dans d'autres pays.</span></p>
<p><span style="font-weight: 400;">Toutes les autres marques, soci&eacute;t&eacute;s et noms de produits sont utilis&eacute;s &agrave; des fins d'identification uniquement et peuvent &ecirc;tre des marques d&eacute;pos&eacute;es appartenant exclusivement &agrave; leurs propri&eacute;taires respectifs.</span></p>
<p><span style="font-weight: 400;">&Eacute;tude de cas ArchiMetal, version 2</span></p>
<p><span style="font-weight: 400;">Num&eacute;ro de document: Y164</span></p>
<p><span style="font-weight: 400;">Publi&eacute; par The Open Group, d&eacute;cembre 2016.</span></p>
<p><span style="font-weight: 400;">Mise &agrave; jour en septembre 2017 pour l'alignement avec la sp&eacute;cification ArchiMate 3.0.1.</span></p>
<p><span style="font-weight: 400;">Tout commentaire concernant le mat&eacute;riel contenu dans ce document peut &ecirc;tre soumis &agrave;:</span></p>
<p><span style="font-weight: 400;">The Open Group, Apex Plaza, Forbury Road, Reading, Berkshire, RG1 1AX, Royaume-Uni</span></p>
<p><span style="font-weight: 400;">ou par email &agrave;:</span></p>
<p><span style="font-weight: 400;">ogpubs@opengroup.org</span></p>
<p><br /><br /></p>
<p><strong>R&eacute;sum&eacute;</strong></p>
<p><span style="font-weight: 400;">Cette &eacute;tude de cas d&eacute;montre la valeur du langage de mod&eacute;lisation ArchiMate&reg; 3.0.1 pour la planification et l'expression d'une transformation m&eacute;tier complexe. L'&eacute;tude de cas concerne un fabricant fictif nomm&eacute; ArchiMetal. Gr&acirc;ce &agrave; une mod&eacute;lisation d'architecture de haut niveau, le langage ArchiMate &eacute;claire la coh&eacute;rence entre une organisation et ses processus, applications et technologies. Cette &eacute;tude de cas pr&eacute;sente des exemples de mod&egrave;les ArchiMate qui peuvent &ecirc;tre &eacute;labor&eacute;s si n&eacute;cessaire pour l'analyse, la communication, l'aide &agrave; la d&eacute;cision et la mise en &oelig;uvre.</span></p>
<p><span style="font-weight: 400;">Cette &eacute;tude de cas d&eacute;crit d'abord l'&eacute;tat de base d'ArchiMetal, en se concentrant sur ses d&eacute;fis de gestion de la relation client (CRM). Il montre comment ces d&eacute;fis peuvent &ecirc;tre relev&eacute;s en modifiant la structure organisationnelle, les processus m&eacute;tier et le portefeuille d&rsquo;applications de l&rsquo;entreprise. Dans le processus, il d&eacute;montre en profondeur l'utilisation du langage ArchiMate, y compris ses couches de base Business, Application et Technology, ainsi que ses extensions de motivation et d'impl&eacute;mentation et de migration.</span></p>
<p><span style="font-weight: 400;">Cette &eacute;tude de cas est con&ccedil;ue pour les architectes d'entreprise et de solutions int&eacute;ress&eacute;s par les approches syst&eacute;matiques de l'architecture en g&eacute;n&eacute;ral et du langage ArchiMate en particulier. Il soutient la vision de l'Open Group de Boundaryless Information Flow &trade; en d&eacute;montrant comment un langage de mod&eacute;lisation visuelle ouvert, standard et largement utilis&eacute; peut &ecirc;tre utilis&eacute; pour guider la transformation complexe de l'entreprise.</span></p>
<p><span style="font-weight: 400;">M&ecirc;me si les concepts et l'approche fournis dans cette &eacute;tude de cas peuvent &ecirc;tre appliqu&eacute;s &agrave; plusieurs industries, des exemples particuliers visent &agrave; soutenir l'industrie manufacturi&egrave;re.</span></p>
<p>&nbsp;</p>
<p><strong>Introduction</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La bonne architecture d'entreprise peut permettre &agrave; un fabricant d'am&eacute;liorer son efficacit&eacute; op&eacute;rationnelle et de r&eacute;duire les risques tout en augmentant la satisfaction client.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La bonne architecture d'entreprise (EA) peut permettre &agrave; un fabricant d'am&eacute;liorer son efficacit&eacute; op&eacute;rationnelle et de r&eacute;duire les risques tout en augmentant la satisfaction client. Le d&eacute;veloppement d'EA utilise des principes, des m&eacute;thodes et des mod&egrave;les pour la conception et la r&eacute;alisation de la structure organisationnelle, des processus m&eacute;tier, des syst&egrave;mes d'information et de la technologie. Cette &eacute;tude de cas illustre la valeur du langage de mod&eacute;lisation ArchiMate&reg; 3.0.1 [1] pour le d&eacute;veloppement et l'impl&eacute;mentation d'EA au sein d'ArchiMetal, un fabricant de pi&egrave;ces m&eacute;talliques fictives. Il illustre principalement les couches de base Business et Application du langage ArchiMate, ainsi que ses deux extensions: Motivation et Impl&eacute;mentation et Migration.</span></p>
<p><span style="font-weight: 400;">ArchiMetal utilise des m&eacute;thodes d'EE bas&eacute;es sur des normes pour conduire le changement organisationnel. L'une des normes EA que l'entreprise utilise en interne est le langage de mod&eacute;lisation visuelle ArchiMate 3.0.1, qui est une norme de The Open Group. Le langage ArchiMate est sp&eacute;cialement con&ccedil;u pour EA. Le langage est &eacute;galement &eacute;troitement align&eacute; sur TOGAF&reg;, une norme de groupe ouvert. La section Concepts de base de cette norme [2] d&eacute;finit l'architecture dans le contexte de la norme TOGAF. Cette section donne &agrave; l'architecture deux significations, selon le contexte dans lequel elle est utilis&eacute;e:</span></p>
<ul>
<li><span style="font-weight: 400;"> Une description formelle d'un syst&egrave;me, ou un plan d&eacute;taill&eacute; du syst&egrave;me au niveau des composants pour guider sa mise en &oelig;uvre</span></li>
<li><span style="font-weight: 400;"> La structure des composants, leurs interrelations et les principes et directives r&eacute;gissant leur conception et leur &eacute;volution dans le temps</span></li>
</ul>
<p><span style="font-weight: 400;">Cette &eacute;tude de cas avanc&eacute;e suppose une solide connaissance de la norme TOGAF, du langage de mod&eacute;lisation visuelle ArchiMate, de la norme ISA-95 pour l'int&eacute;gration des syst&egrave;mes de fabrication [3] et des fonctions d'application de gestion de la relation client (CRM). Les lecteurs souhaitant une introduction &agrave; l'un de ces sujets doivent consulter l'annexe A: Concepts et normes de base.</span></p>
<p><span style="font-weight: 400;">Dans l'&eacute;tude de cas, l'am&eacute;lioration des op&eacute;rations d'ArchiMetal, en utilisant des mod&egrave;les d'architectures de base et cible, est discut&eacute;e. En permettant la mod&eacute;lisation d'architecture de haut niveau, le langage ArchiMate &eacute;claire la coh&eacute;rence entre les organisations, les processus, les applications et la technologie. Les mod&egrave;les ArchiMate peuvent &ecirc;tre &eacute;labor&eacute;s si n&eacute;cessaire pour l'analyse, la communication, l'aide &agrave; la d&eacute;cision et la mise en &oelig;uvre.</span></p>
<p><span style="font-weight: 400;">Pour d&eacute;montrer la valeur du langage de mod&eacute;lisation ArchiMate, l'&eacute;tude de cas se concentre sur l'int&eacute;gration et le partage des donn&eacute;es client &agrave; travers les processus centr&eacute;s sur le client afin d'optimiser la coordination, la prise de d&eacute;cision et l'exp&eacute;rience client au sein d'ArchiMetal. En outre, il montre comment le langage ArchiMate peut &ecirc;tre utilis&eacute; avec des normes sp&eacute;cifiques &agrave; un domaine telles que ISA-95, qui est utilis&eacute;e pour int&eacute;grer des syst&egrave;mes de planification des ressources d'entreprise (ERP) avec des syst&egrave;mes d'ex&eacute;cution de fabrication (MES) qui contr&ocirc;lent l'&eacute;quipement et les processus de fabrication.</span></p>
<p><span style="font-weight: 400;">L'entreprise de fabrication fictive utilis&eacute;e pour cette &eacute;tude est une simplification de ce &agrave; quoi on pourrait s'attendre dans un sc&eacute;nario r&eacute;el. Bien qu'il faille r&eacute;duire la complexit&eacute; pour que l'&eacute;tude reste simple et illustrative pour l'objectif donn&eacute;, un effort a &eacute;t&eacute; fait pour que l'&eacute;tude soit aussi r&eacute;aliste que possible. Les simplifications les plus importantes concernent la structure organisationnelle et l'objectif de l'&eacute;tude sur la coordination entre les ventes et la distribution et la production, au lieu de l'ensemble de la gestion de la cha&icirc;ne d'approvisionnement. Ces limites sont d&eacute;velopp&eacute;es dans l'&eacute;tude de cas. Ce document identifie &eacute;galement quelques opportunit&eacute;s de travail ult&eacute;rieur.</span></p>
<p><span style="font-weight: 400;">En r&eacute;sum&eacute;, l'&eacute;tude de cas d&eacute;crit l'&eacute;tat de base d'ArchiMetal, analyse les d&eacute;fis auxquels l'entreprise est confront&eacute;e et pr&eacute;sente une vision pour y r&eacute;pondre. Il pr&eacute;sente ensuite les architectures cibles n&eacute;cessaires &agrave; la r&eacute;alisation de la vision. Enfin, il pr&eacute;sente un sc&eacute;nario de fabrication utilisant des messages standard ISA-95 pour traiter une commande client urgente, et une version plus d&eacute;taill&eacute;e de l'&eacute;tat cible avec de nouveaux services clients, la refonte de plusieurs processus m&eacute;tier et la rationalisation du paysage applicatif.</span></p>
<p><br /><br /></p>
<p><strong>D&eacute;fis de la transformation ArchiMetal</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">ArchiMetal fait face &agrave; plusieurs d&eacute;fis au service de ses clients et cherche &agrave; se d&eacute;velopper.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">ArchiMetal fait face &agrave; plusieurs d&eacute;fis alors qu'il sert ses clients et cherche &agrave; se d&eacute;velopper. Cette section d&eacute;crit la strat&eacute;gie, la structure et les op&eacute;rations de l&rsquo;entreprise, ainsi que les difficult&eacute;s qu&rsquo;elle doit surmonter pour atteindre ses objectifs.</span></p>
<p>&nbsp;</p>
<p><strong>L&rsquo;historique de l'entreprise</strong></p>
<p><span style="font-weight: 400;">ArchiMetal est une entreprise europ&eacute;enne de taille moyenne qui produit des produits en acier utilis&eacute;s dans la construction de b&acirc;timents et d'autres industries, telles que des poutres, des fils et des tuyaux. La soci&eacute;t&eacute; a r&eacute;cemment d&eacute;velopp&eacute; la capacit&eacute; de produire des produits en acier plat de haute qualit&eacute; et pr&eacute;voit de les vendre aux fabricants de pi&egrave;ces automobiles. Pour r&eacute;ussir sur ce march&eacute; hautement concurrentiel, ArchiMetal doit am&eacute;liorer sa capacit&eacute; CRM et d&eacute;velopper de nouveaux services clients. &Agrave; cette fin, les chefs d'entreprise ont lanc&eacute; un programme de transformation commerciale pour am&eacute;liorer la performance globale de l'entreprise en modifiant la mani&egrave;re dont ArchiMetal interagit avec ses clients.</span></p>
<p><span style="font-weight: 400;">Pour &ecirc;tre comp&eacute;titif sur le march&eacute; de l'approvisionnement automobile, ArchiMetal doit r&eacute;duire le temps de traitement des commandes et, en g&eacute;n&eacute;ral, augmenter la qualit&eacute;, l'efficacit&eacute; et la flexibilit&eacute; de ses activit&eacute;s de traitement des commandes. ArchiMetal a perdu des clients car il a fallu plus de temps que promis pour traiter leurs commandes et ne les a pas tenus au courant de l'&eacute;tat de leurs commandes. Les clients se plaignent de plus en plus de la qualit&eacute; des services d&rsquo;ArchiMetal et ont d&eacute;class&eacute; la soci&eacute;t&eacute; dans des enqu&ecirc;tes de satisfaction client men&eacute;es r&eacute;guli&egrave;rement par des analystes du secteur.</span></p>
<p><span style="font-weight: 400;">La direction d'ArchiMetal entend inverser cette tendance, fid&eacute;liser tous les clients existants, reconqu&eacute;rir d'anciens clients et en acqu&eacute;rir de nouveaux. Par cons&eacute;quent, le programme de transformation doit am&eacute;liorer les ventes et l'ex&eacute;cution des commandes afin de r&eacute;duire le temps n&eacute;cessaire pour traiter les commandes, de livrer syst&eacute;matiquement &agrave; la date promise et d'avertir imm&eacute;diatement les clients de toute circonstance susceptible de retarder leurs commandes. Le programme doit &eacute;galement am&eacute;liorer la satisfaction des clients et lancer de nouveaux services qui ravissent les clients.</span></p>
<p>&nbsp;</p>
<p><strong>Structure organisationnelle</strong></p>
<p><span style="font-weight: 400;">ArchiMetal poss&egrave;de un centre de production (PC) et plusieurs centres de distribution (DC) comme le montre la figure 1. Cependant, une entreprise de fabrication r&eacute;elle, suffisamment complexe pour n&eacute;cessiter ERP et MES, aurait probablement plusieurs PC. Le mod&egrave;le d'exploitation fictif d'ArchiMetal permet aux CD autonomes en Espagne, en Belgique et en Roumanie de se concentrer sur les besoins des clients tout en concentrant la fabrication sur son PC en Pologne. DC Benelux en Belgique et DC Espagne servent les clients du secteur de la construction de la soci&eacute;t&eacute;, tandis que DC East Europe en Roumanie couvre d&rsquo;autres secteurs, situ&eacute;s principalement en Europe de l&rsquo;Est et du Sud-Est. Le si&egrave;ge d'ArchiMetal (HQ) &agrave; Luxembourg abrite la direction g&eacute;n&eacute;rale, ainsi que les d&eacute;partements Finance, Quality Management, Product Development et Human Resources (HR).</span></p>
<p><span style="font-weight: 400;">Le service financier d&eacute;finit les politiques, les proc&eacute;dures et les r&egrave;gles que les CD doivent suivre lorsqu'ils fixent les prix et &eacute;valuent le risque de cr&eacute;dit associ&eacute; aux clients individuels.</span></p>
<p>&nbsp;</p>
<div>
<img src="imgs/fig1.png" />
</div>
<p><em><span style="font-weight: 400;">Figure 1: Les unit&eacute;s commerciales d'ArchiMetal comprennent son si&egrave;ge social (HQ), son centre de production (PC) et un r&eacute;seau de centres de distribution (CD) responsables des ventes et du service client.</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La fonction de relation client de chaque CD &eacute;value le risque de cr&eacute;dit, travaille avec les commerciaux pour n&eacute;gocier les contrats, r&eacute;pond aux plaintes des clients, assure le recouvrement des comptes fournisseurs et g&egrave;re les donn&eacute;es de base des clients. La fonction de vente est responsable des activit&eacute;s de vente, y compris le traitement des commandes des clients depuis leur enregistrement dans le syst&egrave;me jusqu'&agrave; la facturation, qui est de la responsabilit&eacute; de la fonction des finances. La fonction Distribution est en charge du transport des produits finis chez le client.</span></p>
<p><span style="font-weight: 400;">Le PC se procure des mati&egrave;res premi&egrave;res et les utilise pour fabriquer des produits, qu'il stocke dans des entrep&ocirc;ts et distribue aux CD. La fonction Ventes PC pr&eacute;voit les ventes, prend les commandes consolid&eacute;es des CD et les partage avec les fonctions Fabrication et Logistique. La fonction PC Procurement s&eacute;lectionne les fournisseurs et n&eacute;gocie les contrats avec eux. La fonction pr&eacute;voit &eacute;galement la demande de mati&egrave;res premi&egrave;res, les commande et g&egrave;re les niveaux de stock, en s'appuyant fortement sur les informations des fonctions Ventes et Production. La fonction Logistique transporte et stocke aussi bien les mati&egrave;res premi&egrave;res que les produits finis. La fonction Production PC planifie, ex&eacute;cute et surveille la fabrication, et planifie, con&ccedil;oit, construit et entretient &eacute;galement les installations de fabrication.</span></p>
<p>&nbsp;</p>
<p><strong>Processus de manufacture</strong></p>
<p><span style="font-weight: 400;">Pour vous donner un aper&ccedil;u des principaux processus d'ArchiMetal, la figure 2 donne un aper&ccedil;u de haut niveau de sa production et de sa logistique. La figure 3 fournit une vue plus d&eacute;taill&eacute;e de la production physique, en utilisant les &eacute;l&eacute;ments physiques de la sp&eacute;cification ArchiMate 3.0.1. Les mati&egrave;res premi&egrave;res sont trait&eacute;es, celles-ci sont transform&eacute;es en fer liquide par un haut fourneau, qui &agrave; son tour est coul&eacute; et lamin&eacute; pour cr&eacute;er des produits finis en acier, qui sont stock&eacute;s dans un entrep&ocirc;t. Le transport ferroviaire est utilis&eacute; pour d&eacute;placer les produits interm&eacute;diaires et finis sur le site de l'usine, ainsi que pour la distribution au client (non illustr&eacute; sur la figure).</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 2: Production et logistique d'ArchiMetal</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 3: Production d'acier</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Vous pouvez &eacute;galement zoomer sur les installations individuelles, comme le montre la figure 4. Cela montre que le laminoir &agrave; bandes &agrave; chaud contr&ocirc;l&eacute; par ordinateur contient une ligne de rouleaux, qui &agrave; son tour se compose d'un rouleau informatique, avec un logiciel de contr&ocirc;le de processus. Cela montre comment vous pouvez utiliser le langage ArchiMate 3.0.1 pour mod&eacute;liser l'interaction entre les technologies physiques et informatiques.</span></p>
<p><br /><br /></p>
<p><em><span style="font-weight: 400;">Figure 4: Broyeur &agrave; bandes &agrave; chaud plus en d&eacute;tail</span></em></p>
<p>&nbsp;</p>
<p><strong>Analyse du probl&egrave;me</strong></p>
<p><span style="font-weight: 400;">Les responsables de l'effort de transformation d'ArchiMetal ont analys&eacute; les d&eacute;fis que leur programme doit relever: la performance commerciale, la satisfaction du client et la qualit&eacute; du service.1 Les figures 5 et 6 illustrent, &agrave; l'aide des vues de motivation d'ArchiMate, les moteurs qui concernent le plus la gestion d'ArchiMetal et les &eacute;valuations concernant ces pilotes.</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">Les performances d&rsquo;ArchiMetal souffrent de d&eacute;fauts dans son architecture d&rsquo;entreprise&hellip;</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">Les performances commerciales d&rsquo;ArchiMetal souffrent de d&eacute;fauts dans son architecture commerciale, ce qui entra&icirc;ne une approche d&eacute;cousue du service client et du CRM. Ces d&eacute;fauts se refl&egrave;tent &eacute;galement dans l'architecture inad&eacute;quate de ses applications et de ses informations. En particulier, le personnel d&rsquo;ArchiMetal a des points de vue disparates sur la client&egrave;le des diff&eacute;rents services. Les bases de donn&eacute;es clients et les applications des diff&eacute;rents DC ne fonctionnent pas ensemble. En outre, les formats des donn&eacute;es de base des clients varient d'une entreprise &agrave; l'autre. Ces deux facteurs rendent difficile le maintien de donn&eacute;es coh&eacute;rentes et pr&eacute;cises. Cela diminue la qualit&eacute; de l'exp&eacute;rience client, consomme des ressources pour la collecte et le nettoyage de donn&eacute;es redondantes, et expose ArchiMetal &agrave; divers risques. Dans plusieurs cas, un CD a accord&eacute; un cr&eacute;dit aux clients qui manquaient de paiements sur le cr&eacute;dit accord&eacute; par d'autres CD. En plus d'&eacute;valuer de mani&egrave;re inexacte la solvabilit&eacute; des clients, les CD ont accord&eacute; des cr&eacute;dits en violation des politiques &eacute;tablies par l'organisation HQ Finance. Le si&egrave;ge a eu un contr&ocirc;le limit&eacute; sur les op&eacute;rations de cr&eacute;dit des CD, n'intervenant que dans les cas o&ugrave; les CD eux-m&ecirc;mes ont aggrav&eacute; des situations &agrave; risque exceptionnellement &eacute;lev&eacute;.</span></p>
<p><span style="font-weight: 400;">Le PC souffre &eacute;galement d'un manque de visibilit&eacute; client. Ses planificateurs ne peuvent pas observer et &eacute;valuer le pipeline de contacts, de pistes, d'opportunit&eacute;s et d'offres qui, en fin de compte, stimulent la demande de produits manufactur&eacute;s. Ce manque de planification avanc&eacute;e entra&icirc;ne souvent des retards dans l'ex&eacute;cution des commandes des clients en raison de p&eacute;nuries impr&eacute;vues de mati&egrave;res premi&egrave;res et de capacit&eacute; de production, et des co&ucirc;ts accrus en raison d'un exc&egrave;s de mati&egrave;res premi&egrave;res ou d'achats co&ucirc;teux sur le march&eacute; au comptant plut&ocirc;t que par des relations n&eacute;goci&eacute;es avec les fournisseurs.</span></p>
<p><span style="font-weight: 400;">Du point de vue du client, les principaux probl&egrave;mes affectant sa satisfaction sont li&eacute;s aux longs d&eacute;lais, aux services clients m&eacute;diocres et au manque de flexibilit&eacute; dans le traitement de sa commande.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Par souci de simplicit&eacute;, l'analyse du probl&egrave;me se concentre sur la coordination entre les ventes et la distribution et la production. Il ne tient pas compte de l'impact potentiel des probl&egrave;mes qui peuvent exister au sein des fonctions d'approvisionnement et de gestion de la demande. Ces aspects de l'organisation fictive d'ArchiMetal pourraient &ecirc;tre pris en compte dans d'autres travaux.</span></p>
<p><span style="font-weight: 400;">La gestion des commandes entre les DC et le PC est &eacute;galement probl&eacute;matique. Une fois par jour, les DC regroupent les commandes des clients, puis les relient au PC. Ces commandes globales n'incluent aucune information sur les clients qui ont pass&eacute; les commandes originales. Par cons&eacute;quent, les commandes client individuelles ne sont pas visibles dans les syst&egrave;mes PC, et les donn&eacute;es de commande client sont partiellement dupliqu&eacute;es dans diff&eacute;rentes applications de gestion des commandes DC et PC. Ce manque d'informations compl&egrave;tes et opportunes sur les commandes des clients entrave davantage la planification de la production. De plus, il n'y a pas de norme d'identification unique des commandes dans ArchiMetal, ce qui complique davantage la gestion des commandes ainsi que le suivi et l'analyse du comportement des clients.</span></p>
<p><span style="font-weight: 400;">Par cons&eacute;quent, ArchiMetal ne peut pas d&eacute;velopper des profils clients et des historiques d'interaction pr&eacute;cis. Il ne peut pas non plus faire de pr&eacute;visions strat&eacute;giques ni de pr&eacute;paratifs pour la demande future. De m&ecirc;me, il est difficile pour les chefs de produit ArchiMetal d'utiliser les donn&eacute;es disponibles pour effectuer la gestion du cycle de vie des produits; c'est-&agrave;-dire pour d&eacute;terminer s'il faut modifier ou retirer des produits existants ou en introduire de nouveaux. Ce manque de donn&eacute;es inhibe &eacute;galement le marketing ainsi que la gestion des relations clients pour maximiser les ventes rentables et &eacute;viter les situations de perte d'argent.</span></p>
<p><span style="font-weight: 400;">Un autre impact de ces diff&eacute;rents probl&egrave;mes d'information client est une exp&eacute;rience client inf&eacute;rieure &agrave; celle de ses concurrents. Non seulement ArchiMetal perd des clients, mais sa r&eacute;putation en a souffert au point qu'elle doit souvent r&eacute;duire ses prix plus profond&eacute;ment que ses concurrents pour gagner de nouvelles commandes ou des commandes r&eacute;p&eacute;t&eacute;es.</span></p>
<p><span style="font-weight: 400;">Les figures 5 et 6 illustrent, &agrave; l'aide des vues de motivation d'ArchiMate, les pilotes qui concernent le plus la gestion d'ArchiMetal et les &eacute;valuations concernant ces pilotes.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 5: Vue de motivation d'ArchiMate d&eacute;crivant les d&eacute;fis g&eacute;n&eacute;raux auxquels ArchiMetal est confront&eacute;</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 6: Vue de motivation d'ArchiMate d&eacute;crivant la satisfaction du client et les d&eacute;fis de qualit&eacute; de service auxquels ArchiMetal est confront&eacute;</span></em></p>
<p>&nbsp;</p>
<p><strong>La vision CRM d'ArchiMetal</strong></p>
<p><span style="font-weight: 400;">Un groupe de dirigeants d'ArchiMetal s'est r&eacute;uni et a envisag&eacute; une mise en &oelig;uvre CRM r&eacute;ussie (Figure 7). Ils ont visualis&eacute; toute l'entreprise collaborant pour ravir ses clients et &eacute;tablir des relations lucratives avec eux en partageant des informations en temps r&eacute;el. Ils ont imagin&eacute; une organisation centr&eacute;e sur le client dans laquelle chaque service d&eacute;finissait des objectifs mesurables pour servir les clients et mesurait leurs progr&egrave;s gr&acirc;ce &agrave; des tableaux de bord en temps r&eacute;el.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 7: Vision CRM d&rsquo;ArchiMetal</span></em></p>
<p>&nbsp;</p>
<p><strong>Pr&eacute;sentation de la transformation ArchiMetal</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Cette section donne un aper&ccedil;u du programme de transformation d'ArchiMetal avec des mod&egrave;les de haut niveau de l'EE de r&eacute;f&eacute;rence et cible de l'entreprise.</span></p>
<p>&nbsp;</p>
<p><strong>Architecture d'entreprise de base</strong></p>
<p><span style="font-weight: 400;">Les mod&egrave;les d'EE de base simplifi&eacute;s pr&eacute;sent&eacute;s illustrent la communication entre le si&egrave;ge, le PC et l'un des CD. Sur la base des d&eacute;fis auxquels ArchiMetal est confront&eacute;, les mod&egrave;les se concentrent sur les processus orient&eacute;s client.</span></p>
<p>&nbsp;</p>
<p><strong>Architecture d'entreprise</strong></p>
<p><span style="font-weight: 400;">La structure organisationnelle d'ArchiMetal a d&eacute;j&agrave; &eacute;t&eacute; pr&eacute;sent&eacute;e dans la figure 1. La figure 8 identifie les services cl&eacute;s qu'ArchiMetal fournit &agrave; ses clients via ses DC, ainsi que les processus m&eacute;tier qui r&eacute;alisent ces services.</span></p>
<p><span style="font-weight: 400;">Les CD agissent comme des centres de profit et jouissent d'une autonomie significative dans les limites des politiques et proc&eacute;dures obligatoires d'ArchiMetal. Ils ajoutent de la valeur gr&acirc;ce &agrave; l'intimit&eacute; des clients et &agrave; leur capacit&eacute; &agrave; faire des affaires dans leurs r&eacute;gions d&eacute;sign&eacute;es. Par cons&eacute;quent, les DC adaptent leurs processus commerciaux &agrave; des r&eacute;gions et &agrave; des segments de client&egrave;le sp&eacute;cifiques, ce qui emp&ecirc;che la normalisation dans ArchiMetal.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 8: Services &agrave; la client&egrave;le fournis par DC Benelux</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La figure 9 illustre les interd&eacute;pendances entre les principaux processus m&eacute;tier li&eacute;s aux ventes. La figure 10 pr&eacute;sente les d&eacute;tails des flux d'informations sous-tendant ces processus.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 9: Interd&eacute;pendances entre les principaux processus de vente dans DC Benelux, PC et HQ</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 10: Flux d'informations les plus importants entre les unit&eacute;s</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Dans cette figure, les DC re&ccedil;oivent les commandes des clients. HQ &eacute;value le risque associ&eacute; &agrave; certaines de ces commandes. PC re&ccedil;oit des commandes globales des CD pour une utilisation en production.</span></p>
<p>&nbsp;</p>
<p><strong>Architecture d'application de base</strong></p>
<p><span style="font-weight: 400;">La vue Coop&eacute;ration d'application de la figure 11 montre les flux d'informations entre les applications du si&egrave;ge, du DC Benelux et du PC. La figure 11 est un diagramme du paysage des applications ArchiMate qui montre l'utilisation des applications par diff&eacute;rents types d'organisations dans ArchiMetal.</span></p>
<p><span style="font-weight: 400;">DC Benelux utilise ses propres applications de gestion des donn&eacute;es clients pour g&eacute;rer les donn&eacute;es clients, cr&eacute;er des contrats et imprimer, et pour soutenir l'analyse du risque de cr&eacute;dit. L'application de gestion des commandes de DC Benelux g&egrave;re les commandes et &eacute;change les donn&eacute;es avec un syst&egrave;me PC pour la gestion des commandes. Comme indiqu&eacute; pr&eacute;c&eacute;demment, seules les informations de commande agr&eacute;g&eacute;es sont &eacute;chang&eacute;es, sans aucune information sur les commandes individuelles. Le CD utilise &eacute;galement ses propres applications d'exp&eacute;dition et de facturation, ainsi qu'une application financi&egrave;re qui g&egrave;re les cr&eacute;ances.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 11: Paysage d'application d'ArchiMetal</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Dans cette figure, l'int&eacute;gration entre les diff&eacute;rentes applications est activ&eacute;e avec un bus Enterprise Application Integration (EAI). Les donn&eacute;es relatives aux clients ne sont pas standardis&eacute;es au niveau de l'entreprise.</span></p>
<p><span style="font-weight: 400;">PC dispose de sa propre application de gestion des commandes DC, qui communique via le bus EAI avec les applications de gestion des commandes du DC. Le PC utilise une application de facturation pour facturer aux distributeurs chaque commande group&eacute;e ex&eacute;cut&eacute;e. Le PC dispose &eacute;galement d'une solution ERP compos&eacute;e de composants pour la gestion des stocks et des mat&eacute;riaux, la planification de la production et la gestion financi&egrave;re, y compris la maintenance d'un grand livre g&eacute;n&eacute;ral.</span></p>
<p><span style="font-weight: 400;">L'application de gestion des commandes DC s'int&egrave;gre &agrave; la solution ERP afin que les utilisateurs puissent v&eacute;rifier s'il y a suffisamment de produits finis disponibles pour ex&eacute;cuter chaque commande group&eacute;e et planifier une production suppl&eacute;mentaire si n&eacute;cessaire. Une fois qu'il y a suffisamment de produits disponibles pour compl&eacute;ter une commande group&eacute;e, l'application de gestion des commandes fonctionne avec l'application d'exp&eacute;dition pour lancer la livraison.</span></p>
<p><span style="font-weight: 400;">Le bus EAI g&egrave;re la communication entre les applications. Puisqu'il n'y a pas de format standard pour les donn&eacute;es client, une logique de transformation unique existe pour chaque paire d'applications qui doivent fonctionner ensemble pour servir les clients. L'organisation informatique doit effectuer des sp&eacute;cifications, un d&eacute;veloppement et une assurance qualit&eacute; approfondis sur de nombreux modules de code, m&ecirc;me pour les am&eacute;liorations de donn&eacute;es les plus simples. Cela rend difficile pour ArchiMetal de r&eacute;pondre aux nouvelles exigences des clients ou &agrave; d'autres changements dans l'environnement commercial.</span></p>
<p>&nbsp;</p>
<p><strong>La technologie</strong></p>
<p><span style="font-weight: 400;">L'infrastructure informatique ArchiMetal comprend un r&eacute;seau &eacute;tendu (WAN) qui relie le si&egrave;ge, le PC et les DC, un centre de donn&eacute;es d'entreprise au si&egrave;ge, un centre de donn&eacute;es de fabrication sur le PC et des installations informatiques plus petites pour les serveurs de fichiers locaux et les applications &agrave; chaque DC. Chaque centre de donn&eacute;es dispose d'un r&eacute;seau de centre de donn&eacute;es et chaque site dispose d'un r&eacute;seau local (LAN). La figure 12 montre des aspects du centre de donn&eacute;es d'entreprise, qui est bas&eacute; sur un mainframe et des serveurs distribu&eacute;s suppl&eacute;mentaires. Le mainframe est divis&eacute; en plusieurs partitions. Chaque partition se compose de mat&eacute;riel et de logiciels, y compris un syst&egrave;me de gestion de base de donn&eacute;es (SGBD) et fiable logiciel de mise en file d'attente de messagerie, qui fournit des services aux applications. Les serveurs distribu&eacute;s ex&eacute;cutent les syst&egrave;mes d'exploitation UNIX&reg; et les logiciels SGBD et fournissent des services suppl&eacute;mentaires, notamment l'authentification et l'autorisation centralis&eacute;es pour une vari&eacute;t&eacute; d'applications sur les r&eacute;seaux ArchiMetal.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 12: Aspects cl&eacute;s de l'infrastructure du centre de donn&eacute;es ArchiMetal Corporate</span></em></p>
<p>&nbsp;</p>
<p><strong>Architecture d'entreprise cible</strong></p>
<p><span style="font-weight: 400;">L'EA cible r&eacute;alise la vision CRM en fournissant &agrave; ArchiMetal une vue unique et partag&eacute;e de la client&egrave;le. Une nouvelle application CRM g&egrave;re de mani&egrave;re centralis&eacute;e les donn&eacute;es client tout en travaillant avec le syst&egrave;me ERP et d'autres applications. Le personnel d'ArchiMetal utilise l'application CRM pour mieux coordonner les processus de vente, d'ex&eacute;cution des commandes et de services dans toute l'entreprise.</span></p>
<p>&nbsp;</p>
<p><strong>Architecture d'entreprise cible</strong></p>
<p><span style="font-weight: 400;">L'EA cible ajoute un service client au si&egrave;ge d'ArchiMetal (Figure 13). Ce d&eacute;partement d&eacute;finit la structure des donn&eacute;es de base client et g&egrave;re une base de donn&eacute;es client centrale, notamment en supervisant le partage de ces donn&eacute;es avec les processus et syst&egrave;mes ERP. Le service client audite r&eacute;guli&egrave;rement la qualit&eacute; des donn&eacute;es clients et travaille &agrave; l'am&eacute;lioration des processus qui favorisent la qualit&eacute; des donn&eacute;es. Le d&eacute;partement dispose &eacute;galement d'une &eacute;quipe d'analystes de l'information qui analysent les donn&eacute;es clients pour informer les activit&eacute;s de marketing, de vente et de service dans toute l'entreprise. Le service &agrave; la client&egrave;le g&egrave;re &eacute;galement un nouveau service pour suivre les commandes des clients de la soumission initiale au paiement et aide les CD &agrave; recouvrer les comptes d&eacute;biteurs en souffrance. Plus important encore, le service client g&egrave;re un centre de contact consolid&eacute; pour assister et informer les clients.</span></p>
<p><span style="font-weight: 400;">Ces changements permettent aux CD de se concentrer sur les ventes tout en tirant parti des donn&eacute;es et des analyses client am&eacute;lior&eacute;es, plut&ocirc;t que de collecter et de g&eacute;rer les donn&eacute;es client et de traiter les questions et probl&egrave;mes courants. En outre, ils donnent au si&egrave;ge une plus grande visibilit&eacute; et un meilleur contr&ocirc;le sur les pratiques de tarification et de cr&eacute;dit DC &agrave; mesure que les contrats de vente sont n&eacute;goci&eacute;s.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 13: Modifications de la structure organisationnelle d'ArchiMetal, y compris le nouveau d&eacute;partement: Service client</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">L'EA cible centralise &eacute;galement les donn&eacute;es de commande et fournit un support informatique int&eacute;gr&eacute; pour la gestion des commandes via le syst&egrave;me CRM. Cela rend le comportement des clients plus visible dans ArchiMetal et permet de tenir plus facilement les clients inform&eacute;s de l'avancement de leurs commandes. En outre, les donn&eacute;es et analyses client centralis&eacute;es am&eacute;liorent les pr&eacute;visions de ventes et permettent une am&eacute;lioration continue du portefeuille de produits ainsi que des plans de production et d'approvisionnement en fonction du comportement des clients.</span></p>
<p><span style="font-weight: 400;">L'EA cible am&eacute;liore &eacute;galement la coordination du traitement des commandes. Au lieu de transmettre des commandes agr&eacute;g&eacute;es, les DC transmettent des commandes individuelles au PC, qui surveille et publie un statut pour chacun d'entre eux. Cela acc&eacute;l&egrave;re l'ex&eacute;cution des commandes des clients et facilite le traitement des demandes sp&eacute;ciales telles que les commandes urgentes. La figure 14 montre les flux d'informations simplifi&eacute;s qui permettent ces am&eacute;liorations. La figure 15 fournit une vue de haut niveau des &eacute;l&eacute;ments cl&eacute;s de l'EA cible, qui met &eacute;galement en &eacute;vidence une coordination et un alignement am&eacute;lior&eacute;s entre les processus m&eacute;tier ainsi qu'avec leur support d'application.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 14: Flux d'informations pertinents entre les unit&eacute;s commerciales</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Sur cette figure, les nouveaux flux et fonctions sont signal&eacute;s par des caract&egrave;res gras ou des lignes rouges.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 15: Vue d'ensemble des principaux changements dans l'architecture d'entreprise globale d'ArchiMetal</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Cette figure montre l'alignement entre les nouveaux processus, services, flux d'informations et applications. Ces changements sont d&eacute;velopp&eacute;s tout au long de cette section.</span></p>
<p><span style="font-weight: 400;">Comme illustr&eacute; dans la Figure 16, ArchiMetal introduit un service d'information sur les commandes. Les clients peuvent d&eacute;sormais choisir les &eacute;v&eacute;nements dont ils sont inform&eacute;s, ainsi que les types de notifications qu'ils re&ccedil;oivent, tels que les e-mails ou les messages d'&eacute;change de donn&eacute;es informatis&eacute;es (EDI). La figure 17 montre plus en d&eacute;tail la r&eacute;alisation de ce service par un nouveau proc&eacute;d&eacute;.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 16: Le nouveau service client permet une surveillance en temps r&eacute;el des commandes des clients</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 17: Nouveaux processus et leurs interd&eacute;pendances avec les processus existants</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Le fait que tous les processus li&eacute;s &agrave; la commande client traitent la commande client individuelle en m&ecirc;me temps permet une meilleure coordination entre les processus, mais aussi un suivi plus pr&eacute;cis et plus efficace de l'&eacute;tat de la commande de chaque client.</span></p>
<p>&nbsp;</p>
<p><strong>Architecture d'application</strong></p>
<p><span style="font-weight: 400;">L'architecture cible introduit des applications de CRM et de suivi des commandes clients. Ces applications partagent les donn&eacute;es client via un bus EAI.</span></p>
<p><span style="font-weight: 400;">Le syst&egrave;me CRM remplace la fonctionnalit&eacute; des applications utilis&eacute;es dans tous les DC pour la gestion des donn&eacute;es clients. Les DC ont des droits de modification limit&eacute;s sur les donn&eacute;es client, car il incombe au service client&egrave;le du si&egrave;ge de garantir l'exactitude et l'unicit&eacute; des entr&eacute;es client.</span></p>
<p><span style="font-weight: 400;">Le syst&egrave;me CRM g&egrave;re &eacute;galement les commandes clients et remplace ainsi les applications r&eacute;gionales de gestion des commandes et l'application de gestion des commandes client utilis&eacute;es par le PC.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 18: Nouveau paysage applicatif avec le syst&egrave;me CRM partageant les donn&eacute;es client centralis&eacute;es via un bus EAI</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Sur la figure 18, l'application de surveillance des commandes client impl&eacute;mente le service d'informations sur les commandes.</span></p>
<p><span style="font-weight: 400;">Pour permettre le partage des donn&eacute;es de base client, de nouvelles interfaces sont d&eacute;finies et impl&eacute;ment&eacute;es sur le bus EAI. Aux fins de la gestion des commandes, le syst&egrave;me CRM s'interface via le bus avec les composants ERP. La gestion des commandes de production et d'exp&eacute;dition utilis&eacute;e par le PC comprend des informations sur les commandes individuelles des clients.</span></p>
<p><span style="font-weight: 400;">Les applications de facturation DC utilisent des donn&eacute;es de base client partag&eacute;es g&eacute;r&eacute;es par le syst&egrave;me CRM, au lieu de bases de donn&eacute;es clients appartenant aux DC eux-m&ecirc;mes.</span></p>
<p><span style="font-weight: 400;">Les rapports sur l'endettement total des clients sont produits par des applications de facturation en liaison avec le syst&egrave;me CRM, ce qui n&eacute;cessite donc de nouvelles interfaces avec le bus EAI.</span></p>
<p><span style="font-weight: 400;">Enfin, la nouvelle application de suivi des commandes clients automatise le service Informations sur les commandes d&eacute;crit ci-dessus dans l'architecture m&eacute;tier cible. Il met des fonctionnalit&eacute;s cl&eacute;s directement &agrave; la disposition des clients avec une interface utilisateur Web. Cette application combine les donn&eacute;es du syst&egrave;me CRM ainsi que celles des applications r&eacute;gionales de gestion des commandes et d'exp&eacute;dition, avec lesquelles elle s'interface (Figure 18).</span></p>
<p>&nbsp;</p>
<p><strong>Infrastructure</strong></p>
<p><span style="font-weight: 400;">Par rapport &agrave; la ligne de base (Figure 12), l'infrastructure cible a des composants similaires et fournit les m&ecirc;mes types de services. Des serveurs d'applications et de bases de donn&eacute;es suppl&eacute;mentaires sont ajout&eacute;s au centre de donn&eacute;es d'entreprise pour la nouvelle application CRM.</span></p>
<p>&nbsp;</p>
<p><strong>Mise en &oelig;uvre et migration</strong></p>
<p><span style="font-weight: 400;">La figure 19 r&eacute;sume comment ArchiMetal r&eacute;alise sa transformation &agrave; travers un programme compos&eacute; de deux projets successifs, chacun avec des livrables distincts qui atteignent une s&eacute;quence de plateaux ou d'&eacute;tats de syst&egrave;me stables. Le premier projet impl&eacute;mente l'application CRM et le second impl&eacute;mente le suivi des commandes clients. La figure 19 est une vue de haut niveau; il ne montre pas les pilotes initiaux et les d&eacute;ploiements incr&eacute;mentiels utilis&eacute;s par chaque projet pour att&eacute;nuer les risques d'interruption des activit&eacute;s et d'erreurs de traitement.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 19: Vue d'impl&eacute;mentation et de migration pour le programme de transformation ArchiMetal CRM</span></em></p>
<p>&nbsp;</p>
<p><strong>Architecture d'entreprise cible d&eacute;taill&eacute;e</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Cette section fournit des d&eacute;tails suppl&eacute;mentaires sur l'EA cible, y compris un sc&eacute;nario d&rsquo;une commande urgente qui illustre l'utilisation du langage ArchiMate avec une norme cl&eacute; pour l'int&eacute;gration des syst&egrave;mes de fabrication.</span></p>
<p>&nbsp;</p>
<p><strong>Utilisation des processus m&eacute;tier et des applications</strong></p>
<p><span style="font-weight: 400;">La transformation CRM affecte en particulier les processus de d&eacute;veloppement de contrat, d'enregistrement de commande, de suivi de la commande client et de traitement de commande client, qui ont &eacute;t&eacute; introduits dans la figure 17.</span></p>
<p><span style="font-weight: 400;">Pour mod&eacute;liser plus en d&eacute;tail ces processus et leur support applicatif, deux points de vue d&eacute;finis par le standard ArchiMate sont utilis&eacute;s: Processus M&eacute;tier et Application.</span></p>
<p>&nbsp;</p>
<p><strong>D&eacute;velopper un contrat</strong></p>
<p><span style="font-weight: 400;">Le processus de passation de contrats avec les nouveaux clients reste la responsabilit&eacute; des CD r&eacute;gionaux car leurs forces de vente sont les plus proches du client et connaissent les langues et les lois r&eacute;gionales.</span></p>
<p><span style="font-weight: 400;">Les changements apport&eacute;s au processus existant sont mis en &eacute;vidence en rouge sur la figure 20. Il y a maintenant une v&eacute;rification formelle des donn&eacute;es pour chaque nouveau client (Approuver les donn&eacute;es client, affect&eacute;es au si&egrave;ge). Cette v&eacute;rification emp&ecirc;che la duplication des clients dans les donn&eacute;es de base client partag&eacute;es examin&eacute;es par ce processus.</span></p>
<p><span style="font-weight: 400;">La figure 21 montre comment le processus de d&eacute;veloppement de contrat est pris en charge par le nouveau syst&egrave;me CRM, plut&ocirc;t que par des applications et des bases de donn&eacute;es sp&eacute;cifiques aux DC. Dans le nouveau syst&egrave;me, les DC peuvent toujours saisir de nouveaux clients et apporter certaines modifications aux donn&eacute;es client.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 20: Enregistrement d'un nouveau client</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 21: Prise en charge du processus de d&eacute;veloppement de contrat</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 22: Enregistrement de la commande client</span></em></p>
<p>&nbsp;</p>
<p><strong>Enregistrer la commande</strong></p>
<p><span style="font-weight: 400;">Le processus d'enregistrement des nouvelles commandes des clients demeure la responsabilit&eacute; des CD r&eacute;gionaux. Comme illustr&eacute; sur la figure 22, la commande du client est accept&eacute;e apr&egrave;s la v&eacute;rification de l'exposition au cr&eacute;dit du client (c'est-&agrave;-dire apr&egrave;s l'analyse de l'exposition totale par client par rapport &agrave; la limite de cr&eacute;dit attribu&eacute;e et &agrave; l'historique de recouvrement). Tout en conservant son autonomie pour accepter les commandes, le CD doit toujours demander, au si&egrave;ge, l'approbation des commandes pr&eacute;sentant un risque de recouvrement des paiements potentiellement &eacute;lev&eacute;. Lors de l'enregistrement de la commande client, le suivi de son statut est automatiquement lanc&eacute;.</span></p>
<p><span style="font-weight: 400;">Les commandes clients sont g&eacute;r&eacute;es dans le module CRM pour la gestion des commandes clients (Figure 23). La communication avec d'autres syst&egrave;mes, comme l'exp&eacute;dition de la commande client, se fait via le bus EAI via de nouvelles interfaces d'application.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 23: Utilisation de l'application par processus de commande de registre</span></em></p>
<p><br /><br /><br /></p>
<p><strong>Suivi de la commande client</strong></p>
<p><span style="font-weight: 400;">Le nouveau processus de suivi des commandes client (Figure 24) r&eacute;alise le service d'informations sur les commandes, qui fournit l'&eacute;tat des commandes aux clients en temps r&eacute;el.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 24: Suivi du processus de commande client</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Un abonnement au service d'information sur les commandes peut &ecirc;tre &eacute;tabli avec un contrat client ou au fur et &agrave; mesure de chaque commande. Le client peut &eacute;galement &agrave; tout moment souscrire &agrave; ce service sur le site Internet d'ArchiMetal. Des notifications au client sur l'&eacute;tat de sa commande peuvent &ecirc;tre envoy&eacute;es pour l'un de ces &eacute;v&eacute;nements:</span></p>
<ul>
<li><span style="font-weight: 400;"> Commande accept&eacute;e</span></li>
<li><span style="font-weight: 400;"> Commande re&ccedil;ue par PC</span></li>
<li><span style="font-weight: 400;"> Estimation de production disponible</span></li>
<li><span style="font-weight: 400;"> Commande en production</span></li>
<li><span style="font-weight: 400;"> Estimation de livraison disponible</span></li>
<li><span style="font-weight: 400;"> Commande exp&eacute;di&eacute;e depuis le PC</span></li>
<li><span style="font-weight: 400;"> La commande est arriv&eacute;e au DC</span></li>
<li><span style="font-weight: 400;"> Commande exp&eacute;di&eacute;e au client</span></li>
</ul>
<p><span style="font-weight: 400;">Les notifications clients sont g&eacute;n&eacute;r&eacute;es par l'application de suivi des commandes clients en fonction de ces &eacute;v&eacute;nements. Cette application g&egrave;re l'abonnement du client au service de suivi, qui comprend les notifications d'&eacute;v&eacute;nement demand&eacute;es, ainsi que les canaux (interfaces) par lesquels les informations doivent &ecirc;tre envoy&eacute;es au client.</span></p>
<p><span style="font-weight: 400;">Le service client est responsable du service d'information des commandes et de l'application de suivi des commandes clients</span></p>
<p><span style="font-weight: 400;">.</span></p>
<p><strong>Traiter la commande client</strong></p>
<p><span style="font-weight: 400;">Le nouveau processus, Traiter la commande client (Figure 25), remplace le processus pr&eacute;c&eacute;dent, Traitement de la commande client sur PC. Ce nouveau processus traite les commandes des clients individuels plut&ocirc;t que regroup&eacute;es. Relier la production et l'exp&eacute;dition &agrave; la commande individuelle du client permet une visibilit&eacute; &agrave; l'&eacute;chelle de l'entreprise des donn&eacute;es relatives aux clients et aux commandes. En outre, cette transparence permet une flexibilit&eacute; de fabrication et jette les bases pour offrir des services clients avanc&eacute;s, tels que la passation de commande urgente et prioritaire, et la modification tardive des commandes.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 25: Processus de traitement des commandes client</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Le processus de traitement des commandes client utilise le syst&egrave;me CRM pour acc&eacute;der aux donn&eacute;es de commande client (Figure 26), au lieu des bases de donn&eacute;es locales pr&eacute;c&eacute;demment utilis&eacute;es. Dans le cadre du processus, les commandes de production et d'exp&eacute;dition sont g&eacute;n&eacute;r&eacute;es pour chaque commande client.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 26: Utilisation des applications par le processus de processus de commande client</span></em></p>
<p><br /><br /></p>
<p><strong>Sc&eacute;nario d'&eacute;tat cible: traitement d'une commande client urgente</strong></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">Ce sc&eacute;nario illustre l'utilisation du langage ArchiMate avec la norme ISA-95&hellip;</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Ce sc&eacute;nario illustre l'utilisation du langage ArchiMate avec la norme ISA-95 pour la communication entre l'ERP et les syst&egrave;mes d'ex&eacute;cution de fabrication.</span></p>
<p><span style="font-weight: 400;">Il y a plusieurs ann&eacute;es, ArchiBuilder, une entreprise de construction qui ach&egrave;te r&eacute;guli&egrave;rement des poutres en acier &agrave; ArchiMetal, a commenc&eacute; &agrave; travailler sur un nouveau b&acirc;timent. Cependant, au d&eacute;but du processus de construction, le march&eacute; local de l&rsquo;immobilier commercial a connu une grave r&eacute;cession et le promoteur de l&rsquo;immeuble n&rsquo;a pas pu obtenir un financement suffisant pour poursuivre la construction. Depuis, le march&eacute; local s'est am&eacute;lior&eacute; et le promoteur vient d'obtenir un financement suffisant pour continuer. Cependant, ce financement est subordonn&eacute; &agrave; un calendrier ambitieux pour la location et l'ach&egrave;vement de l'immeuble, afin que les locataires puissent emm&eacute;nager et commencer &agrave; effectuer des paiements de location. Par cons&eacute;quent, ArchiBuilder a un besoin imm&eacute;diat pour un ensemble de poutres en acier qui ont d&eacute;j&agrave; &eacute;t&eacute; con&ccedil;ues par un ing&eacute;nieur en structure et &eacute;valu&eacute;es par ArchiMetal. ArchiBuilder passe donc une commande urgente pour les poutres avec ArchiMetal. La commande fait r&eacute;f&eacute;rence &agrave; une commande pr&eacute;c&eacute;dente qu'ArchiBuilder a annul&eacute;e lorsque le processus de construction s'est arr&ecirc;t&eacute; en raison d'un manque de financement. Ce sc&eacute;nario d&eacute;crit comment ArchiMetal re&ccedil;oit et ex&eacute;cute cette commande.</span></p>
<p><span style="font-weight: 400;">Un acheteur chez ArchiBuilder t&eacute;l&eacute;phone &agrave; son repr&eacute;sentant commercial ArchiMetal, qui prend l'appel &agrave; son bureau &agrave; DC Benelux. Le repr&eacute;sentant est nouveau sur ArchiMetal et n'est donc pas au courant de la commande pr&eacute;c&eacute;demment annul&eacute;e. Cependant, pendant qu'il est au t&eacute;l&eacute;phone, il utilise la nouvelle application CRM pour revoir l'historique de la commande annul&eacute;e pendant que l'agent d'achat ArchiBuilder discute de la n&eacute;cessit&eacute; de sa r&eacute;int&eacute;gration. Une fois que le repr&eacute;sentant ArchiMetal a compris la situation, il clique sur un lien dans le syst&egrave;me CRM, qui le connecte automatiquement au syst&egrave;me ERP ArchiMetal et affiche des informations sur la commande annul&eacute;e. Ensuite, il cr&eacute;e une nouvelle commande bas&eacute;e sur une copie de la commande annul&eacute;e. &Eacute;tant donn&eacute; que ArchiMetal n'a pas fix&eacute; le prix de la commande annul&eacute;e depuis plusieurs ann&eacute;es, il doit &ecirc;tre r&eacute;&eacute;valu&eacute; en fonction des conditions actuelles du march&eacute; et &eacute;galement sur un calendrier de production acc&eacute;l&eacute;r&eacute; demand&eacute; par ArchiBuilder. La vue des parties prenantes de la figure 27 utilise les concepts et les relations de l'extension ArchiMate Motivation pour exprimer cette situation. Cette vue des parties prenantes montre les relations entre le constructeur (ArchiBuilder) et le fabricant de produits de construction (ArchiMetal).</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 27: Vue des parties prenantes</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Le repr&eacute;sentant ArchiMetal d&eacute;clenche un workflow pour r&eacute;&eacute;valuer la commande et g&eacute;n&eacute;rer les contrats n&eacute;cessaires. Le flux de travail commence par deux &eacute;tapes parall&egrave;les. Un ing&eacute;nieur du d&eacute;partement de fabrication du PC utilise le syst&egrave;me ERP pour planifier la fabrication de la commande ArchiBuilder, y compris les montants et les prix de tous les mat&eacute;riaux n&eacute;cessaires, ainsi que tous les outillages et r&eacute;glages n&eacute;cessaires, ainsi qu'un calendrier de livraison propos&eacute; pour les poutres. Dans le m&ecirc;me temps, un sp&eacute;cialiste du cr&eacute;dit du d&eacute;partement HQ Finance &eacute;value ArchiBuilder et d&eacute;termine les r&egrave;gles selon lesquelles ArchiMetal doit accorder le cr&eacute;dit. Une fois ces deux &eacute;tapes termin&eacute;es, un sp&eacute;cialiste des propositions collabore avec le responsable de compte d'ArchiBuilder pour d&eacute;velopper une proposition de fabrication des poutres. Ensuite, ils pr&eacute;sentent la proposition aux responsables des ventes et de la production, qui peuvent exiger des modifications avant de l'approuver. Une fois les approbations termin&eacute;es, le responsable de compte remet la proposition au responsable des achats d'ArchiBuilder. Quelques jours plus tard, ArchiBuilder accepte la proposition en envoyant un contrat sign&eacute; &eacute;lectroniquement &agrave; ArchiMetal. La vue Business Process Cooperation de la Figure 28 d&eacute;crit le processus de conversion d'une commande en contrat chez ArchiBuilder. Dans cette optique, les services d'application CRM et ERP sont agr&eacute;g&eacute;s des comportements visibles de l'ext&eacute;rieur des composants d'application mentionn&eacute;s ailleurs dans cette &eacute;tude de cas.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 28: Coop&eacute;ration des processus m&eacute;tier - Conversion d'une commande en contrat</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Une fois qu'ArchiMetal re&ccedil;oit une commande, un commercial la saisit &agrave; l'aide du service d'application CRM. Ensuite, un sp&eacute;cialiste du cr&eacute;dit et un ing&eacute;nieur de fabrication travaillent en parall&egrave;le pour &eacute;valuer le cr&eacute;dit client et planifier la commande. La planification des commandes implique la conception, la tarification et la planification, et utilise le service d'application ERP. Une fois l'&eacute;valuation du cr&eacute;dit et la planification des commandes termin&eacute;es, un sp&eacute;cialiste des propositions travaille avec les responsables des comptes, des ventes et de la production pour d&eacute;velopper une proposition approuv&eacute;e, qu'un repr&eacute;sentant client doit accepter avant qu'elle ne soit en place. Le service d'application CRM utilise le service d'application ERP pour afficher des informations sur les commandes pr&eacute;c&eacute;dentes.</span></p>
<p><span style="font-weight: 400;">Une fois le formulaire re&ccedil;u, ArchiMetal se pr&eacute;pare &agrave; ex&eacute;cuter cette commande urgente. Un planificateur de production utilise le syst&egrave;me ERP pour activer le plan de fabrication des poutres, un planificateur logistique utilise le syst&egrave;me ERP pour activer le calendrier de livraison, qui comprend l'envoi de commandes aux soci&eacute;t&eacute;s de transport de fret pr&eacute;f&eacute;r&eacute;es, et un ing&eacute;nieur de fabrication commence le processus de pr&eacute;paration d'une production disponible. ligne pour fabriquer les poutres. La vue Business Process Cooperation de la Figure 29 ci-dessous montre comment ArchiMetal ex&eacute;cute une commande.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 29: Coop&eacute;ration des processus d'affaires - Ex&eacute;cution d'une commande chez ArchiMetal</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Une fois la ligne de production pr&ecirc;te, le module de planification ERP utilise les messages standard ISA-95 pour diriger le MES qui contr&ocirc;le la production. Plus pr&eacute;cis&eacute;ment, le module de planification utilise un message PROCESS2 pour transmettre le programme du premier cycle de production, et le MES renvoie un message ACKNOWLEDGE - ACCEPTED pour accuser r&eacute;ception du message. Au fur et &agrave; mesure que la production se poursuit, le module de surveillance ERP demande l'&eacute;tat au MES &agrave; l'aide d'un message GET, auquel le MES r&eacute;pond par un message SHOW. L'ERP transmet les mises &agrave; jour des statuts cl&eacute;s au syst&egrave;me CRM utilis&eacute; par les fonctions marketing et commerciales afin que leur personnel dispose d'informations &agrave; jour tout en travaillant avec leurs contacts ArchiBuilder. La production se d&eacute;roule comme pr&eacute;vu jusqu'au troisi&egrave;me cycle de production lorsqu'un dysfonctionnement de manque de mati&egrave;re suspend la production pendant plusieurs heures. L'ERP utilise un message SYNC CHANGE pour communiquer le programme r&eacute;vis&eacute; au MES, qui utilise un message RESPOND pour indiquer qu'il a mis en &oelig;uvre le changement. La vue Processus m&eacute;tier de la Figure 30 ci-dessous montre comment les fonctions m&eacute;tier d'ArchiBuilder Enterprise et Control &eacute;changent des messages afin de modifier un planning de production. Les vues de processus m&eacute;tier peuvent afficher des fonctions m&eacute;tier ainsi que des processus.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 30: Vue Processus m&eacute;tier</span></em></p>
<p><span style="font-weight: 400;">Pendant que le MES ex&eacute;cute ce planning r&eacute;vis&eacute;, ArchiMetal re&ccedil;oit un message urgent d'ArchiBuilder: une refonte mineure du b&acirc;timent n&eacute;cessite des poutres suppl&eacute;mentaires rapidement. Une fois qu'ArchiMetal a trait&eacute; cet ordre de modification, le syst&egrave;me ERP envoie un message SYNC CHANGE au MES pour r&eacute;viser &agrave; nouveau le programme de production, accompagn&eacute; d'une paire de messages PROCESS. Le premier message PROCESS indique au MES d'ajouter un nouveau programme de production pour les poutres suppl&eacute;mentaires. Le deuxi&egrave;me message PROCESS indique au MES d'ajouter de l'&eacute;quipement suppl&eacute;mentaire pour respecter le nouveau calendrier. En r&eacute;ponse, le MES &eacute;met un message RESPOND pour le SYNC CHANGE, ainsi que deux messages ACKNOWLEDGE pour les messages PROCESS. Le premier ACKNOWLEDGE renvoie l'identifiant (ID) que le MES a attribu&eacute; au nouveau calendrier de production, et le second ACKNOWLEDGE renvoie les ID de l'&eacute;quipement que le MES a ajout&eacute; pour respecter le nouveau calendrier. La vue Structure des informations de la Figure 31 montre comment les messages g&eacute;r&eacute;s par les applications r&eacute;alisent les messages &eacute;chang&eacute;s entre les fonctions m&eacute;tier ArchiBuilder Enterprise et Control dans ce sc&eacute;nario. Les objets m&eacute;tier sont r&eacute;alis&eacute;s par des objets de donn&eacute;es. Les paires demande-r&eacute;ponse sont li&eacute;es &agrave; des relations d'association.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 31: Vue de la structure d'information</span></em></p>
<p><br /><br /></p>
<p><strong><em>Avantages de l'architecture d'entreprise avec le langage ArchiMate</em></strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La vue partag&eacute;e des clients et les processus coordonn&eacute;s de services &agrave; la client&egrave;le mis en &oelig;uvre dans le cadre de l&rsquo;initiative de transformation d&eacute;crite dans cette &eacute;tude de cas ont am&eacute;lior&eacute; le service &agrave; la client&egrave;le et la satisfaction d&rsquo;ArchiMetal. Les clients d'ArchiMetal, en moyenne, &eacute;valuent l'entreprise beaucoup plus haut sur les enqu&ecirc;tes de satisfaction p&eacute;riodiques et sont beaucoup moins susceptibles de choisir des fournisseurs alternatifs. La vue partag&eacute;e des clients a &eacute;galement permis &agrave; ArchiMetal de coordonner la n&eacute;gociation client, l'ex&eacute;cution des commandes et la r&eacute;solution des probl&egrave;mes dans toute l'entreprise. En cons&eacute;quence, les efforts contradictoires et en double dans ces domaines ont &eacute;t&eacute; &eacute;limin&eacute;s, et les co&ucirc;ts de main-d'&oelig;uvre ont par cons&eacute;quent diminu&eacute;. ArchiMetal peut d&eacute;sormais n&eacute;gocier avec les clients, pr&eacute;voir la demande et r&eacute;soudre les probl&egrave;mes de livraison en une seule entreprise, ce qui a abouti &agrave; des contrats clients plus rentables avec des d&eacute;lais de livraison acc&eacute;l&eacute;r&eacute;s.</span></p>
<p><span style="font-weight: 400;">Ces r&eacute;alisations ont augment&eacute; les revenus d'ArchiMetal et diminu&eacute; leurs d&eacute;penses. Reconnaissant que cette augmentation des performances commerciales &eacute;tait due &agrave; des changements internes fondamentaux et durables, la direction d'ArchiMetal a ordonn&eacute; une comparaison des performances financi&egrave;res d'ArchiMetal et de la satisfaction des clients avec les informations accessibles au public sur le march&eacute; de l'approvisionnement automobile. Une &eacute;quipe d'experts financiers, de fabrication, de service et de marketing d'ArchiMetal a constat&eacute; qu'ArchiMetal fonctionnait &agrave; un niveau comparable &agrave; celui des leaders du march&eacute; de l'approvisionnement automobile. La direction d'ArchiMetal a ensuite charg&eacute; la m&ecirc;me &eacute;quipe d'&eacute;laborer un plan pour p&eacute;n&eacute;trer ce march&eacute;.</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">&hellip; Les participants ont cit&eacute; des projets et des livrables finaux qui ont permis &agrave; toutes les parties prenantes de collaborer ind&eacute;pendamment de leurs ant&eacute;c&eacute;dents et ont fourni une base claire pour le travail des sp&eacute;cialistes&hellip;</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">Lors d'un examen interdisciplinaire de routine de l'ensemble de l'initiative de transformation peu de temps apr&egrave;s son ach&egrave;vement, tous les intervenants participants ont convenu que le travail s'&eacute;tait d&eacute;roul&eacute; plus facilement que des efforts comparables dans le pass&eacute;. Ils ont attribu&eacute; cela en grande partie &agrave; une meilleure &eacute;valuation environnementale. En particulier, les participants ont cit&eacute; des projets et des livrables finaux qui ont permis &agrave; toutes les parties prenantes de collaborer ind&eacute;pendamment de leurs ant&eacute;c&eacute;dents et ont fourni une base claire pour le travail des sp&eacute;cialistes dans des domaines tels que la conception de logiciels, de bases de donn&eacute;es et de processus m&eacute;tier. Les vues ArchiMate dans les figures et les tableaux de cette &eacute;tude de cas &eacute;taient des &eacute;l&eacute;ments cl&eacute;s de ces livrables.</span></p>
<p><br /><br /></p>
<p><strong>Conclusion</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Cette &eacute;tude de cas d&eacute;montre la valeur d'une approche d'EE formelle avec une mod&eacute;lisation visuelle normalis&eacute;e pour l'am&eacute;lioration op&eacute;rationnelle des activit&eacute;s &agrave; l'aide de techniques applicables &agrave; toute organisation de fabrication.</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">Les mod&egrave;les ArchiMate fournissent une vue d'ensemble des processus m&eacute;tier et de leur informatique sous-jacente, tout en omettant intentionnellement les d&eacute;tails de conception&hellip;</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">EA fournit une vue holistique de l'entreprise et capture les &eacute;l&eacute;ments essentiels de l'entreprise, ses syst&egrave;mes d'information et leur &eacute;volution. En tant que tel, il s'agit d'un &eacute;l&eacute;ment crucial des initiatives de transformation d'entreprise. L'&eacute;tude de cas illustre en particulier comment le standard Open Group ArchiMate pour la mod&eacute;lisation architecturale de haut niveau peut &ecirc;tre utilis&eacute; pour analyser, concevoir et guider les processus de transformation d'entreprise. Les mod&egrave;les ArchiMate fournissent une vue d'ensemble des processus m&eacute;tier et de leur informatique sous-jacente, tout en omettant intentionnellement les d&eacute;tails de conception des processus, des applications et de l'infrastructure technique. Le langage de mod&eacute;lisation ArchiMate se concentre plut&ocirc;t sur la structure globale de ces domaines et sur les relations entre eux. Cela aide les parties prenantes, des dirigeants d'entreprise aux ing&eacute;nieurs, &agrave; comprendre l'alignement entre les composants tels que les processus m&eacute;tier et leurs applications de support.</span></p>
<p><span style="font-weight: 400;">Les concepts du langage de mod&eacute;lisation ArchiMate sont suffisamment g&eacute;n&eacute;riques et expressifs pour mod&eacute;liser de nombreux aspects de la structure, de la motivation et du fonctionnement de l'entreprise, ainsi que de la structure et de la fonction de la technologie de support. Cependant, le langage ArchiMate n'est pas con&ccedil;u pour remplacer les langages pour la conception sp&eacute;cifique et d&eacute;taill&eacute;e, tels que BPMN &trade; [4] pour les processus m&eacute;tier ou UML&reg; [5] pour les logiciels. Au contraire, le langage ArchiMate encadre et int&egrave;gre le travail entre les niveaux via des mod&egrave;les d'architecture de haut niveau.</span></p>
<p><span style="font-weight: 400;">Le langage ArchiMate peut &eacute;galement &ecirc;tre utilis&eacute; avec des standards sp&eacute;cifiques aux domaines m&eacute;tiers. Dans cette &eacute;tude de cas, ArchiMate est utilis&eacute; avec la norme ISA-95 [3] pour int&eacute;grer les syst&egrave;mes d'information utilis&eacute;s dans les entreprises de fabrication. ISA-95 r&eacute;git l'&eacute;change d'informations entre les syst&egrave;mes d'entreprise et les syst&egrave;mes de contr&ocirc;le pour la production, la maintenance et la qualit&eacute;.</span></p>
<p><span style="font-weight: 400;">&Agrave; l'instar de l'archiMetal fictif, pratiquement toutes les organisations doivent changer de mani&egrave;re significative &agrave; un moment donn&eacute; - sinon de mani&egrave;re continue - pour survivre ou prosp&eacute;rer. Le langage ArchiMate est un outil puissant pour d&eacute;velopper et communiquer les motivations, les transitions commerciales, applicatives et technologiques, et les approches de mise en &oelig;uvre pour des transformations complexes et critiques.</span></p>
<p><br /><br /></p>
<p><strong>Possibilit&eacute;s de travail suppl&eacute;mentaire</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Comme indiqu&eacute; pr&eacute;c&eacute;demment, l'organisation ArchiMetal utilis&eacute;e pour cette &eacute;tude de cas est plus simple que les sc&eacute;narios typiques de la vie r&eacute;elle. Les simplifications les plus importantes concernent la structure organisationnelle et l'accent mis sur les ventes, la production et la distribution plut&ocirc;t que sur l'ensemble de la cha&icirc;ne d'approvisionnement.</span></p>
<p><span style="font-weight: 400;">Dans le sc&eacute;nario d&eacute;crit ici, ArchiMetal ne dispose que d'un seul PC. Pour une entreprise suffisamment grande pour n&eacute;cessiter des capacit&eacute;s ERP et MES int&eacute;gr&eacute;es, plusieurs PC sont plus susceptibles. Par exemple, si plusieurs PC fabriquaient les m&ecirc;mes produits, la planification de la production au niveau de l'entreprise n&eacute;cessiterait un moyen de pr&eacute;voir la capacit&eacute; globale. Cela aurait un impact sur la capacit&eacute; d'ArchiMetal &agrave; promettre la livraison des produits aux clients. Cette dimension pourrait &ecirc;tre prise en compte dans les futures versions de l'&eacute;tude de cas.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">&hellip; Les futures versions de cette &eacute;tude de cas pourraient consid&eacute;rer l'ensemble de la cha&icirc;ne d'approvisionnement&hellip;</span></p>
<p><em><span style="font-weight: 400;">_________________________________________________________________________</span></em></p>
<p><span style="font-weight: 400;">Le sc&eacute;nario de cette &eacute;tude de cas se concentre sur les capacit&eacute;s de vente, de production et de distribution d'ArchiMetal. En particulier, la fourniture de mati&egrave;res premi&egrave;res et de produits semi-finis au PC et sa relation avec la planification de la production et les ventes ne sont pas discut&eacute;es. Cependant, les futures versions de cette &eacute;tude de cas pourraient prendre en compte l'ensemble de la cha&icirc;ne d'approvisionnement afin de traiter tous les facteurs impliqu&eacute;s dans la promesse et la livraison de produits.</span></p>
<p><span style="font-weight: 400;">Un traitement plus complet de la cha&icirc;ne d'approvisionnement pourrait &eacute;galement prendre en compte l'effet de coup de fouet [6] des fluctuations de plus en plus larges des stocks, alors que les variations de la demande des clients se r&eacute;percutent en amont dans la cha&icirc;ne d'approvisionnement. Le manque de coordination entre les ventes et la distribution et la planification de la production d&eacute;crit dans cette &eacute;tude de cas peut d&eacute;clencher cet effet. Les futures versions du sc&eacute;nario ArchiMetal pourraient inclure les techniques de pr&eacute;vision et de distribution collaboratives que les organisations utilisent pour &eacute;viter une telle volatilit&eacute;.</span></p>
<p><span style="font-weight: 400;">En outre, l'&eacute;tude de cas n'aborde actuellement que la production physique et la logistique de mani&egrave;re superficielle, montrant comment celles-ci peuvent &ecirc;tre mod&eacute;lis&eacute;es &agrave; l'aide des &eacute;l&eacute;ments physiques de la sp&eacute;cification ArchiMate 3.0.1. Dans une future version, l'&eacute;tude de cas pourrait &ecirc;tre &eacute;tendue pour inclure &agrave; la fois la production physique et la logistique plus en d&eacute;tail et la nature contr&ocirc;l&eacute;e par ordinateur des op&eacute;rations de fabrication modernes dans un monde &laquo;Industrie 4.0&raquo;. Un mod&egrave;le int&eacute;gr&eacute; de bout en bout du produit, de l'information et des flux de valeur au sein de l'ensemble de la cha&icirc;ne d'approvisionnement constituerait un instrument d'analyse utile &agrave; de nombreuses fins diff&eacute;rentes.</span></p>
<p><br /><br /></p>
<p><strong>Annexe A: Concepts et normes de base</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Cette section pr&eacute;sente les concepts et les normes d'EA, de fabrication et de CRM au c&oelig;ur de l'&eacute;tude de cas ArchiMetal.</span></p>
<p>&nbsp;</p>
<p><strong>L'architecture d'entreprise</strong></p>
<p><span style="font-weight: 400;">Au c&oelig;ur de ce travail se trouve le concept d'entreprise. D'apr&egrave;s [7]:</span></p>
<p><span style="font-weight: 400;">Une entreprise est un syst&egrave;me socio-technique complexe qui comprend des ressources interd&eacute;pendantes de personnes, d'informations et de technologies qui doivent interagir les unes avec les autres et avec leur environnement pour soutenir une mission commune.</span></p>
<p><span style="font-weight: 400;">Dans l'&eacute;tude de cas, l'entreprise est ArchiMetal, un fabricant fictif de produits m&eacute;talliques. L'&eacute;tude de cas d&eacute;crit les &eacute;tats de base et cible de l'entreprise ArchiMetal dans chacun des quatre domaines TOGAF EA. Chaque domaine a de diff&eacute;rents domaines de pr&eacute;occupation [2].</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Tableau 1: Domaines TOGAF EA et leurs pr&eacute;occupations</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La norme TOGAF sp&eacute;cifie une m&eacute;thode de d&eacute;veloppement d'architecture (ADM) pour d&eacute;velopper les EE, les transformer en plans exploitables et les g&eacute;rer &agrave; mesure que les circonstances commerciales et techniques &eacute;voluent au fil du temps (Figure 32). Il existe une correspondance directe entre les domaines d'EE d&eacute;finis par la norme TOGAF et les trois phases ADM. La phase B (architecture commerciale) et la phase D (architecture technologique) guident respectivement le d&eacute;veloppement des domaines commerciaux et technologiques, tandis que la phase C (architectures des syst&egrave;mes d'information) guide le d&eacute;veloppement des domaines des donn&eacute;es et des applications.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 32: M&eacute;thode de d&eacute;veloppement de l'architecture TOGAF</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Le langage ArchiMate [1] est &eacute;troitement align&eacute; sur le standard TOGAF (Figure 33). Il prend en charge les phases B &agrave; D d'ADM en mod&eacute;lisant ses trois aspects de la structure passive, du comportement et de la structure active au niveau de chacune de ses trois couches principales: activit&eacute;s, application et technologie. De plus, il comprend deux extensions. La strat&eacute;gie et les &eacute;l&eacute;ments de motivation prennent en charge la phase pr&eacute;liminaire, la gestion des exigences, la phase A et la phase H avec des concepts tels que les capacit&eacute;s, les ressources, les parties prenantes, les moteurs, les &eacute;valuations, les objectifs et les exigences. Les &eacute;l&eacute;ments de mise en &oelig;uvre et de migration concernent la phase E du SMA (opportunit&eacute;s et solutions), la phase F (planification de la migration) et la phase G (gouvernance de la mise en &oelig;uvre), avec des concepts tels que les lots de travail, les lacunes, les livrables et les plateaux, qui sont des &eacute;tats stables du syst&egrave;me&hellip;</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 33: Alignement entre le standard TOGAF et le langage ArchiMate</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Les entit&eacute;s mod&eacute;lis&eacute;es avec les &eacute;l&eacute;ments de mise en &oelig;uvre et de migration r&eacute;alisent des &eacute;l&eacute;ments de base tels que les processus m&eacute;tier, les composants d'application et le mat&eacute;riel serveur. Ces &eacute;l&eacute;ments de base peuvent &agrave; leur tour &ecirc;tre montr&eacute;s pour r&eacute;aliser des &eacute;l&eacute;ments de motivation tels que les exigences et les objectifs. La figure 34 fournit un exemple g&eacute;n&eacute;rique de relations entre le noyau d'ArchiMate et d'autres &eacute;l&eacute;ments. Il mod&eacute;lise la transformation commerciale et les projets informatiques comme des lots de travail ArchiMate qui r&eacute;alisent respectivement des services m&eacute;tier et applicatifs. Ces services r&eacute;alisent &agrave; leur tour les objectifs commerciaux et informatiques. Le service m&eacute;tier est r&eacute;alis&eacute;/fourni par un processus m&eacute;tier. Un serveur (p&eacute;riph&eacute;rique mat&eacute;riel) r&eacute;alise/h&eacute;berge un composant d'application, qui &agrave; son tour r&eacute;alise/fournit le service d'application utilis&eacute; par le processus m&eacute;tier.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 34: Exemple g&eacute;n&eacute;rique de couches principales et d'extensions ArchiMate</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Dans la figure 34, les &eacute;l&eacute;ments de la couche de gestion sont jaunes, les &eacute;l&eacute;ments de la couche d'application sont bleus et l'&eacute;l&eacute;ment de couche de technologie est vert. Les concepts d'extension de motivation sont violets et les concepts d'extension d'impl&eacute;mentation et de migration sont roses.</span></p>
<p>&nbsp;</p>
<p><strong>Fabrication</strong></p>
<p><span style="font-weight: 400;">La combinaison de la norme TOGAF et du langage ArchiMate donne une approche d'EE polyvalente applicable &agrave; un large &eacute;ventail de d&eacute;fis de transformation d'entreprise. Cette &eacute;tude de cas compl&egrave;te ces paradigmes compatibles avec ISA-95 [3], qui est une norme d'int&eacute;gration de syst&egrave;mes utilis&eacute;s dans les entreprises de fabrication. ISA-95 r&eacute;git l'&eacute;change d'informations entre les syst&egrave;mes d'entreprise 3 tels que ceux qui prennent en charge les ventes, les finances et la logistique avec des syst&egrave;mes de contr&ocirc;le pour la production, la maintenance et la qualit&eacute;.</span></p>
<p><span style="font-weight: 400;">ISA-95 b&eacute;n&eacute;ficie d'un large soutien de l'industrie. Il est g&eacute;r&eacute; par l'International Society for Automation [8], qui est une organisation professionnelle qui revendique plus de 30 000 membres. ISA-95 est pris en charge dans les produits des principaux fournisseurs informatiques, tels que IBM [9], SAP [10] et Oracle [11], et constitue &eacute;galement la base de la norme CEI 62241.4 The Business to Manufacturing Markup Language (B2MML) [12] impl&eacute;mente ISA-95 en XML et constitue &eacute;galement la base de la CEI 62264. 5</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Tableau 2: Structure de la norme ISA-95 pour l'int&eacute;gration du syst&egrave;me de contr&ocirc;le d'entreprise</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La norme ISA-95 comprend cinq parties (tableau 2). Cette &eacute;tude de cas utilise la partie 1 d'ISA-95 pour fournir un mod&egrave;le fonctionnel global de l'interface du syst&egrave;me de contr&ocirc;le d'entreprise, la partie 3 pour mod&eacute;liser les interactions de gestion du flux de travail &agrave; travers cette interface et les informations de niveau sup&eacute;rieur de la partie 5 pour identifier les transactions; c'est-&agrave;-dire des s&eacute;quences de messages qui traversent l'interface. Les informations des parties 2 et 4, ainsi que les &eacute;l&eacute;ments de message au niveau du champ et les sp&eacute;cifications de transaction d&eacute;taill&eacute;es de la partie 5, sont trop d&eacute;taill&eacute;s pour EA.</span></p>
<p><span style="font-weight: 400;">Le langage g&eacute;n&eacute;raliste ArchiMate s'adapte facilement au domaine de la fabrication. La figure 35 ci-dessous est un r&eacute;sum&eacute; du mod&egrave;le de contr&ocirc;le d'entreprise fonctionnel d'ArchiMate bas&eacute; sur ISA-95. Dans cette figure, les fl&egrave;ches montrent l'utilisation des relations entre les fonctions, services et interfaces m&eacute;tier et applicatifs. Les figures 36 et 37, respectivement, montrent les fonctions d'entreprise et de contr&ocirc;le ISA-95. ISA-95 utilise un mod&egrave;le fonctionnel de fabrication &agrave; cinq niveaux. Le niveau 4 comprend les fonctions d'entreprise pour la planification des activit&eacute;s et la logistique; Le niveau 3 comprend les op&eacute;rations de fabrication et les fonctions de contr&ocirc;le (souvent abr&eacute;g&eacute;es en &laquo;contr&ocirc;le&raquo;); et les niveaux 2, 1 et 0 d&eacute;finissent des fonctions pour la supervision de cellules ou de lignes de fabrication, les op&eacute;rations et le contr&ocirc;le de processus. ISA-95 concerne l'interface entre les niveaux 3 et 4; c'est-&agrave;-dire l'interface de contr&ocirc;le d'entreprise.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 35: Vue en couches r&eacute;capitulative d'un mod&egrave;le de contr&ocirc;le d'entreprise fonctionnel bas&eacute; sur ISA-95</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La figure 35 utilise trois couleurs pour d&eacute;signer diff&eacute;rents types de fonctions m&eacute;tier d'entreprise. Les symboles jaunes repr&eacute;sentent les fonctions de planification d'entreprise et de logistique de niveau 4 d&eacute;crites dans la norme ISA-95. Les symboles orange repr&eacute;sentent des fonctions suppl&eacute;mentaires d&eacute;crites par la norme qui interagissent avec les fonctions de niveau 4. Le symbole vert repr&eacute;sente une fonction d'entreprise - le service client - qui est ins&eacute;r&eacute;e dans le mod&egrave;le fonctionnel de l'&eacute;tude de cas.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 36: Fonctions d'entreprise ISA-95 niveau 4</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 37: Fonctions m&eacute;tier de contr&ocirc;le ISA-95 niveau 3</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La figure 37 illustre la relation entre les fonctions d'entreprise et de contr&ocirc;le ISA-95 et l'environnement de fabrication physique. Le regroupement le plus &eacute;lev&eacute; de cette figure montre qu'un site est utilis&eacute; par une entreprise et qu'un site est compos&eacute; de zones. Le niveau 4, fonctions commerciales (d'entreprise), s'applique ici. Le groupe inf&eacute;rieur suivant montre les composants qui composent une zone de fabrication et leurs contr&ocirc;leurs, qui sont mod&eacute;lis&eacute;s comme des n&oelig;uds ArchiMate. Le niveau 3, fonctions de gestion (contr&ocirc;le), s'applique &agrave; ce regroupement. Les activit&eacute;s de fabrication de base de niveau 0, 1 et 2 imbriqu&eacute;es dans ce groupe sont affect&eacute;es aux composants dans les zones de fabrication.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 38: Hi&eacute;rarchie des &eacute;quipements montrant les empreintes physiques des niveaux fonctionnels d&eacute;finis dans ISA-95</span></em></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">La partie 5 de la norme ISA-95 d&eacute;finit les transactions d'entreprise &agrave; fabrication. La norme d&eacute;finit les transactions, les messages et les verbes [3: Partie 5, p.18]. Il existe trois mod&egrave;les de transaction, chacun utilisant des verbes diff&eacute;rents. Il existe un mod&egrave;le PUBLISH, dans lequel un propri&eacute;taire de donn&eacute;es publie &agrave; plusieurs abonn&eacute;s, un mod&egrave;le PULL o&ugrave; un utilisateur de donn&eacute;es (humain ou machine) fait une demande &agrave; un fournisseur de donn&eacute;es, et un mod&egrave;le PUSH, o&ugrave; un utilisateur fournit des donn&eacute;es &agrave; un autre utilisateur et demande &agrave; cet utilisateur d&rsquo;effectuer une action de traitement, de modification ou d'annulation sur ces donn&eacute;es. La figure 39 montre les verbes ISA-95 class&eacute;s selon le mod&egrave;le de transaction qu'ils prennent en charge. Le verbe CONFIRM est utilis&eacute; pour effectuer des transactions dans les trois mod&egrave;les.</span></p>
<p><span style="font-weight: 400;">************************</span></p>
<p><br /><br /></p>
<p><em><span style="font-weight: 400;">Figure 40: Un mod&egrave;le de l'activit&eacute; qui se produit lorsqu'une commande importante et urgente d&eacute;clenche une modification du calendrier de production</span></em></p>
<p>&nbsp;</p>
<p><strong>Gestion de la relation client (CRM)</strong></p>
<p><span style="font-weight: 400;">&Eacute;tant donn&eacute; que ISA-95 ne d&eacute;crit pas le r&ocirc;le des syst&egrave;mes CRM dans les entreprises de fabrication, cette &eacute;tude de cas utilise le mod&egrave;le de la figure 41 pour compl&eacute;ter les mod&egrave;les de fabrication ISA-95.</span></p>
<p><span style="font-weight: 400;">La figure 41 montre la taxonomie des fonctions typiques des applications CRM. Les applications CRM ont g&eacute;n&eacute;ralement des fonctions d'acquisition et de fid&eacute;lisation des clients, ainsi que de compr&eacute;hension des clients, ce que l'on appelle souvent l'intelligence d'affaires. La figure 42 montre comment ces fonctions sont utilis&eacute;es par les fonctions de marketing et de vente d'entreprise et de service client&egrave;le d'entreprise dans ce mod&egrave;le &eacute;tendu. Ces diagrammes illustrent comment le langage ArchiMate peut &ecirc;tre utilis&eacute; pour combiner et adapter divers paradigmes &agrave; utiliser dans EA.</span></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 41: Une taxonomie des fonctions d'application CRM typiques</span></em></p>
<p>&nbsp;</p>
<p><em><span style="font-weight: 400;">Figure 42: Utilisation des fonctions de l'application CRM par les fonctions d'entreprise d'entreprise</span></em></p>
<p>&nbsp;</p>
<p><strong>[References]</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[1]ArchiMate&reg;3.0.1, an Open Group Standard(C179), published by The Open Group, August 2017; refer to: </span><a href="http://www.opengroup.org/bookstore/catalog/c179.htm"><span style="font-weight: 400;">www.opengroup.org/bookstore/catalog/c179.htm</span></a><span style="font-weight: 400;">.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[2]TOGAF&reg;, an Open Group Standard (G116), published by The Open Group, December 2011; refer to: </span><a href="http://www.opengroup.org/togaf"><span style="font-weight: 400;">www.opengroup.org/togaf</span></a><span style="font-weight: 400;">.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[3]ISA-95: SA-95: International Standard for the Integration of Enterprise and Control Systems; refer to: </span><a href="http://www.isa-95.com/"><span style="font-weight: 400;">www.isa-95.com</span></a><span style="font-weight: 400;">.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[4]Object Management Group Business Process Model and Notation (BPMN); refer to: </span><a href="http://www.bpmn.org/"><span style="font-weight: 400;">www.bpmn.org</span></a><span style="font-weight: 400;">.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[5]Object Modeling Group Unified Modeling Language (UML); refer to: </span><span style="font-weight: 400;">www.uml.org</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[6]University of San Francisco Online: Managing the Bullwhip Effect on your Supply Chain; refer to: www.usanfranonline.com/managing-the-bullwhip-effect-on-your-supply-chain(retrieved July 5, 2016).</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[7]R.E. Giachetti: Design of Enterprise Systems, Theory, Architecture, and Methods, CRC Press, Boca Raton, FL, p.4, 2010.</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[8]ISA | The International Society for Automation; refer to: www.isa.org(retrieved July 5, 2016).</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[9]What&rsquo;s new in IBM Integrated Information Core?,IBM,2012; refer to: www.ibm.com/support/knowledgecenter/SS8TBK_1.5.0/iic/ov_whats_new.html(retrieved July 5, 2016).</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[10]J. Wettengl: SAP Manufacturing and Interoperability, SAP AG, 2006; refer to: fm.sap.com/pdf/8182/14_Wettengl.pdf(retrieved July 5, 2016).</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[11]Oracle Manufacturing Operations Center Data Sheet, Oracle 2010;refer to: www.oracle.com/us/products/applications/057127.pdf(retrieved July 5, 2016).</span></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">&nbsp;&nbsp;&nbsp; </span><span style="font-weight: 400;">[12]Business to Manufacturing Markup Language (B2MML); refer to: www.mesa.org/en/B2MML.asp(retrieved July 5, 2016).</span></p>
<p>&nbsp;</p>
<p><strong>A propos des auteurs</strong></p>
<p>&nbsp;</p>
<p><strong>Iver Band, Cambia Health Solutions</strong></p>
<p><span style="font-weight: 400;">Iver Band est un architecte d'entreprise en exercice et un d&eacute;veloppeur et un communicateur des normes et m&eacute;thodes d'architecture d'entreprise. Chez Cambia Health Solutions, il a guid&eacute; des initiatives ax&eacute;es sur les syst&egrave;mes des fournisseurs, les exp&eacute;riences Web et mobiles, ainsi que les m&eacute;thodes et outils d'architecture. Il se concentre actuellement sur des solutions qui fournissent des informations sur les consommateurs et les groupes de soins de sant&eacute;. Iver est &eacute;galement le vice-pr&eacute;sident &eacute;lu du Forum Open Group ArchiMate&reg;. Il a dirig&eacute; le d&eacute;veloppement de plusieurs livres blancs Open Group et a contribu&eacute; aux deuxi&egrave;me et troisi&egrave;me versions majeures du langage de mod&eacute;lisation ArchiMate. Il est certifi&eacute; TOGAF 9&reg; et ArchiMate 2, un professionnel certifi&eacute; de la s&eacute;curit&eacute; des syst&egrave;mes d'information (CISSP), un professionnel de l'information certifi&eacute; (CIP), un professionnel des technologies de l'information AHIP et un consultant en changement certifi&eacute; Prosci.</span></p>
<p>&nbsp;</p>
<p><strong>Marija Bjekovi, Institut luxembourgeois des sciences et technologies</strong></p>
<p><span style="font-weight: 400;">Marija Bjekovi travaille au Luxembourg Institute of Science and Technology (LIST) &agrave; Luxembourg. Ses domaines d'int&eacute;r&ecirc;t comprennent la mod&eacute;lisation d'entreprise, l'architecture d'entreprise, la mod&eacute;lisation conceptuelle, la conception de syst&egrave;mes d'information et l'ing&eacute;nierie ax&eacute;e sur les mod&egrave;les. Elle travaille actuellement sur un doctorat. projet qui &eacute;tudie les aspects fondamentaux de la mod&eacute;lisation, le r&ocirc;le et l'utilisation des langages de mod&eacute;lisation d'entreprise. Son parcours scolaire combine les syst&egrave;mes d'information et les sciences de l'organisation. Elle a obtenu son dipl&ocirc;me d'ing&eacute;nieur SI en 2003 &agrave; la Facult&eacute; des Sciences des Organisations de Belgrade, Serbie, et son Master en Management et Technologie des Syst&egrave;mes d'Information en 2005 dans le programme commun de l'Universit&eacute; de Gen&egrave;ve, Suisse et de l'Universit&eacute; d'Annecy, France. Elle a travaill&eacute; comme ing&eacute;nieur logiciel en Serbie et ing&eacute;nieur de recherche au LIST, avant de se lancer dans un doctorat. projet.</span></p>
<p>&nbsp;</p>
<p><strong>Steve Else, directeurs EA</strong></p>
<p><span style="font-weight: 400;">Apr&egrave;s une carri&egrave;re r&eacute;ussie en tant que pilote de l'US Air Force, attach&eacute; de d&eacute;fense et membre du personnel du Pentagone, Steve Else est devenu consultant en ing&eacute;nierie des syst&egrave;mes et en architecture d'entreprise aupr&egrave;s du gouvernement et d'autres entreprises du monde entier. Tout en dirigeant &eacute;galement l'entreprise, il a cr&eacute;&eacute; EA Principals (le premier sponsor du programme de certification ArchiMate&reg;), il est l'un des principaux consultants, conf&eacute;renciers et enseignants au monde en ce qui concerne l'application de l'architecture pour am&eacute;liorer et transformer m&ecirc;me les plus grands et les plus complexes. des organisations. Il a occup&eacute; le poste d'architecte d'entreprise en chef au minist&egrave;re de la Sant&eacute; et des Services sociaux (inspecteur g&eacute;n&eacute;ral) et a &eacute;t&eacute; architecte principal d'entreprise &agrave; la FDIC.Il apporte donc une exp&eacute;rience approfondie et une grande passion dans ses efforts pour aider &agrave; m&ucirc;rir la discipline EA. Avec des partenaires cl&eacute;s, il vient de lancer un outil de mod&eacute;lisation ArchiMate bas&eacute; sur le Cloud soutenu par un r&eacute;f&eacute;rentiel afin d'acc&eacute;l&eacute;rer l'adoption du langage ArchiMate pour la transformation de l'entreprise.</span></p>
<p>&nbsp;</p>
<p><strong>Rob Kroese, BiZZdesign</strong></p>
<p><span style="font-weight: 400;">Rob Kroese est consultant et formateur en architecture d'entreprise chez BiZZdesign. Rob a une exp&eacute;rience en affaires et en informatique, et il l'utilise dans son travail de conseil pour optimiser l'alignement entre les affaires et l'informatique. En tant que consultant EA, Rob aide les organisations de diff&eacute;rents secteurs (par exemple, la finance, le gouvernement, les assurances, etc.) &agrave; mettre en place une solide pratique d'EE, souvent avec les normes TOGAF&reg; et / ou ArchiMate&reg; comme approche. Au sein de BiZZdesign, Rob contribue activement au d&eacute;veloppement des outils logiciels, &agrave; la formation et aux propositions de conseil. Rob dispense r&eacute;guli&egrave;rement des cours de formation sur l'architecture d'entreprise, la norme TOGAF, la norme ArchiMate et la gestion des processus m&eacute;tier. Rob a &eacute;tudi&eacute; le commerce et l'informatique &agrave; l'Universit&eacute; de Twente &agrave; Enschede, aux Pays-Bas. En 2004, il obtient son dipl&ocirc;me de BSc, et en 2007, il termine ses &eacute;tudes et obtient son dipl&ocirc;me de ma&icirc;trise.</span></p>
<p>&nbsp;</p>
<p><strong>Marc Lankhorst, BiZZdesign</strong></p>
<p><span style="font-weight: 400;">Marc Lankhorst is Managing Consultant and Business Design Evangelist at BiZZdesign. He is responsible for market development, consulting, and coaching on digital business design and Enterprise Architecture, and spreading the word on the ArchiMate&reg; standard for Enterprise Architecture modeling. His expertise and interests range from enterprise and IT architecture and business process management to agile methods, portfolio management, and digital business design. In the past, he has managed the ArchiMate R&amp;D project, a major cooperation between several partners from government, industry, and academia which developed the initial version of the ArchiMate language, and he currently leads the ArchiMate development team of The Open Group.</span></p>
<p><br /><br /></p>
<p><strong>Remerciements</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">Les auteurs souhaitent remercier Henry Franken et Dick Quartel de BiZZdesign, Bill Estrem de Metaplexity et Chris Forde de The Open Group pour leurs r&eacute;visions approfondies et r&eacute;fl&eacute;chies de la premi&egrave;re version de cette &eacute;tude de cas.</span></p>
<p>&nbsp;</p>
<p><strong>&Agrave; propos du groupe ouvert</strong></p>
<p>&nbsp;</p>
<p><span style="font-weight: 400;">L'Open Group est un consortium mondial qui permet d'atteindre les objectifs commerciaux gr&acirc;ce &agrave; des normes informatiques. Avec plus de 500 organisations membres, The Open Group a une composition diversifi&eacute;e qui couvre tous les secteurs de la communaut&eacute; informatique - clients, fournisseurs de syst&egrave;mes et de solutions, fournisseurs d'outils, int&eacute;grateurs et consultants, ainsi que des universitaires et des chercheurs - pour:</span></p>
<ul>
<li><span style="font-weight: 400;"> Capturer, comprendre et r&eacute;pondre aux exigences actuelles et &eacute;mergentes, &eacute;tablir des politiques et partager les meilleures pratiques</span></li>
<li><span style="font-weight: 400;"> Faciliter l'interop&eacute;rabilit&eacute;, d&eacute;velopper un consensus, faire &eacute;voluer et int&eacute;grer les sp&eacute;cifications et les technologies open source</span></li>
<li><span style="font-weight: 400;"> Exploitez le premier service de certification du secteur</span></li>
</ul>
<p><span style="font-weight: 400;">De plus amples informations sur l'Open Group sont disponibles sur </span><a href="http://www.opengroup.org/"><span style="font-weight: 400;">www.opengroup.org</span></a><span style="font-weight: 400;">.</span></p>
<p><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /><br /></p>